{"0":{"subreddit":"food","id":"14v5iw","comment_body":"Made them for Christmas, with the cheese sauce as described, garnished with cornichons &amp; the odd hotdogtopus. This inspired a rash of other dubious delicacies, including a ham glazed in Coke, DIY KFC bean salad &amp; miniature Elvis sandwiches. Quite different to our normal Christmas fare, but a big hit. \n\nThank you, you're a legend.","score_com":1,"title":"Deep fried hot dog stars with cheese sauce.","selftext":"","score":2026},"1":{"subreddit":"Music","id":"15q2g1","comment_body":"Dj shadow is my favorite artist and a top-tier performer.  His live sets, be it his music or a set of tunes that have inspired and grooved him, are phenomenal.  This club's  decision  robbed at least one person in the crowd the joy of  not only shadow's music, but the music of obscure and long forgotten artists past.  This is a shame.\n\nJosh, feel free to come to nola anytime.  I have enjoyed your previous four visits, and will continue to bob my head at every show forthwith.......cheers\n","score_com":1,"title":"DJ Shadow kicked off decks in Miami - \"I don't care if I get kicked out of every rich kid club on the planet. I will never sacrifice my integrity as a DJ...ever\"","selftext":"","score":1861},"2":{"subreddit":"KerbalSpaceProgram","id":"15qf0e","comment_body":"I'm inspired :D","score_com":4,"title":"Can a group of KSP fans but an inexperienced pilot on Mun? Mission control simulation.","selftext":"","score":1793},"3":{"subreddit":"AskReddit","id":"15qmfc","comment_body":"I can't find evidence that these ever existed but I totally remember my nan taking me to Wawa to get them: Wacky Willy Milkshake. It was a big yellow carton that had that extra thick chocolate milk they marketed as \"shake\" before Nesquik and Hershey bit the bandwagon on them. (around 1997-99)\n\nAlso, these candy bar inspired granola bars, specifically remember one that included twix, pretzels, and some other snackies.","score_com":1,"title":"What is your favorite product that has been discontinued?","selftext":"Simple question.  What product did you love that the rest of the world just didn't get on board with and was subsequently discontinued?\n\nWe could be talking Crystal Pepsi to the Mcdonalds Hula Burger or anything in between?\n\nEDIT: First, wow.. this is long overdue.. Thanks to everyone, it's pretty amazing to see how much stuff has been \"missed\".. As my first (Semi-2nd) post ever this was an amazing turnout.  I didn't realize until a friend of mine told me that I should edit this and let people know what has been said..\n\nBasically, everything has been said, if you aren't over 50 and remember things from before that time, it has likely been said.. THanks so much.. can you \"close\" off a post to responses without deleting it? Just curious","score":1750},"4":{"subreddit":"videos","id":"15mmna","comment_body":"This video inspired\/spoke to me thanks.","score_com":0,"title":"White kid singing the blues like it's nobody's business.","selftext":"","score":1682},"5":{"subreddit":"pics","id":"15q41s","comment_body":"Very well done! I was inspired by the surprising amount of breaking bad portraits on reddit. Here's my Jesse, we may have even used the same reference. Thought I would share.\n\nhttp:\/\/s3images.coroflot.com\/user_files\/individual_files\/original_357574_FaWLIiP34S0sYW3VGm2ZPqhnM.jpg\n\n","score_com":1,"title":"Jesse.","selftext":"","score":1604},"6":{"subreddit":"IAmA","id":"15q589","comment_body":"Just wanted to say, even though I'm sure your mom is stocked on these comments, that she is amazing, and a fabulous inspiration. Thank you for posting this on New Years Eve! Makes me all that more inspired. Good job perservering (sp) and being incredible, OP's mom!!!","score_com":1,"title":"IAMA a cook who lost her eyesight five years ago, but still cooks everyday. AMA","selftext":"To avoid confusion: I (her eldest son) will be helping my mom type up the answers.\n\nMy mother lost her eyesight more than five years ago (doctors have yet to identify a specific cause, with some hypothesizing conversion disorder or a rare eye disease they haven't understood yet). \n\nA lifelong housewife and passionate cook (though she never cooked \"professionally\"), her dishes outdo anything from a five-star restaurant (and that's not me being biased). And today she celebrates her 50th birthday.\n\nThis is her flipping prathas, a type of Indian flatbread: http:\/\/www.youtube.com\/watch?v=fQaiJIMO_1s\n\nShe made this spread yesterday: http:\/\/imgur.com\/a\/oxAV0\n\nAnd she made these over the past year. Like a true artist, presentation is equally important for her. So yes, amazingly, she did the presentation herself. Photos were taken to include in a cookbook I'm working on putting together for her: (edit--photo credit: Sonya Kumpus) http:\/\/imgur.com\/a\/HgFKH\n\n\nEDIT: She expresses her gratitude for all questions and birthday wishes, saying that this has been the best birthday so far. She is eager to continue answering more, between preparing the day's meals--we're not allowed to cook anything for her, especially in her kitchen. \"When I come to your kitchen, then you can cook for me.\"\n\n\nEDIT: Thanks for all the love! My mom is very honored and humbled to get on the front page. And she wants to continue answering more questions. Thanks for making her day. You guys gave her the best birthday present.","score":1596},"7":{"subreddit":"space","id":"15q5ge","comment_body":"I'm not Canadian, but your live tweeting\/redditing of your trip is really inspiring and just damn cool. Rock on Mr Hadfield! \nAnd also mad props to you, DoctorNose, for your part in showcasing what's going on to \/r\/space and the rest of the reddit community. \n\nTHERE'S A REDDITOR! IN! **SPAAAAAAAAACE!**","score_com":1,"title":"Earth, Moon and Soyuz: Kevin Ford took this picture as we approached Station last week. Amazing work of extraplanetary art.","selftext":"","score":1584},"8":{"subreddit":"Music","id":"15qoej","comment_body":"This is awesome...I've never known anything about opeth other than the name and this has inspired me to change that.","score_com":16,"title":"Opeth- The Drapery Falls (Seriously, give it a chance...) ","selftext":"","score":1550},"9":{"subreddit":"GetMotivated","id":"15q55e","comment_body":"This is probably the most inspiring thing i have seen in the time i have been subscribed to this subreddit. Her strength is so radiant, I just want to give her a high five. Made my day to see someone who has every reason to feel defeated or cynical about the hand they were dealt in life but instead has taken charge of her life in ways most people never will. Beautiful. ","score_com":3,"title":"Lessons from the 'World's Ugliest Woman': 'Stop Staring and Start Learning'","selftext":"","score":1506},"10":{"subreddit":"pics","id":"15qu06","comment_body":"I'm never convinced with these post thats its not simply inspired govt propoganda effort.... sorry to the OP if he 100% upfront genuine.","score_com":3,"title":"Here's a picture i took during my tour in Afghanistan. This little girl and her friend followed me and my squad for troughtout the patrol and keept ushering probably the only english words she knew. Thank you. Thank you. Over and over again.","selftext":"","score":1496},"11":{"subreddit":"loseit","id":"15q8vt","comment_body":"Shows how big of a role two people can play in each other's lives. Truly inspiring.","score_com":1,"title":"My husband and I have lost 259 pounds together!","selftext":"I wanted to end 2012 with a reminder of where my husband and I have come from. I threw together [these photos](http:\/\/imgur.com\/a\/79jY3) and couldn't believe the changes. \n\nJeremiah's highest weight was 260 pounds. He slimmed down to about 210 for our wedding by cutting out sodas, counting calories and eating more vegetables. In June of 2012 he began following a ketogenic diet. As much bulletproof coffee as he wants, kale shakes for lunch and low\/carb free dinner! He used a standing desk at his office for 40+ hours a week as well as doing body squats. He's down to 168 pounds and still losing. \n\nMy highest weight was 312 pounds and I'm now at 145. I cut out carbs and sugars. upped my protein and limited my calorie intake. I followed C25K to start myself into exercise. I joined my husband on a ketogenic diet although much more loosely. He aims for 25g of carbs while I float below 100g. \n\nWe have been a great positive influence on each other. We exchanged kettlebells for Christmas and are excited to continue on our path of health!\n\n\n**edit:** Guys, thank you so much for all the positivity and compliments! A few answers to some reoccurring questions: I started my weight loss journey 02\/2010. Jeremiah doesn't have any lose skin, but I definitely want to tone up my tummy and arms more. That said, DON'T let this scare you away from being healthy! I would rather have excess skin than still be three hundred pounds. Oh, and sex is awesome. ;D","score":1431},"12":{"subreddit":"AskReddit","id":"15q5m5","comment_body":"[Clodia Metelli](http:\/\/en.wikipedia.org\/wiki\/Clodia), just to see what all the fuss was about. My username here was (likely) inspired by her.","score_com":1,"title":"If you could have sex with any historical figure, who would it be?","selftext":"It could be anybody, alive or dead.\n\nedit:  context? (when, where, how, why, to what extent)","score":1351},"13":{"subreddit":"leagueoflegends","id":"15qev9","comment_body":"Thank you snoopeh for being the rolemodel so many LoL-players need. Watching you keeping your cool (that correct? :D) when shit is going down is realy inspiring. Giving insight and reasoning on every champ you chose helps seasoned players as well as newbies to get better at this game. \n\nI wish you and your team all the best for 2013.\n\nI'm looking forward to see you own in major tournaments.","score_com":2,"title":"Happy New Year \/r\/leagueoflegends","selftext":"**Happy New Year!**\n----\n\n-----\nWhat can I say, 2012 has been a fantastic year for us (the community). We are now almost 200,000 strong and that alone is cause to celebrate – however I would like extend thanks to :\n\n**My team:** Mitch, Peter, Mike &amp; Henrik - *We have shared a fantastic year with each other, seen, done &amp; achieved things we never thought we would - I look forward to another year of the same!*\n\n**The Organisation:** *We had our ups and downs over the course of the year, but it's been one hell of a ride - thanks for giving us a home for the past year George - your a great friend and I wish you all the best and look forward to seeing you again next year!* \n\n\n**Riot Games:** *Their investment into eSports has not only provided me with a sustainable career which I can at least follow for the immediate future, but they have revolutionized eSports itself. They have immensely talented individuals within and outside eSports - it has been a pleasure to work with and meet you all.*\n\n**The Fans:** *You've simply been inspiring, your continued support over the past year has been overwhelming. Especially when you sent us to Dreamhack and we climbed through the BYOC to take 1st place against M5. Or when we had our extended Bo3 series.. (7 hours+a day) vs World Elite -  you.. just like us kept motivated and spurred us on. We hope you continue to support us as we transition next year!*\n\n**The Community:** Your amazing content on Reddit, whether it was \"dog support,\" endless dunk videos... amazing interviews\/journalism, funky cosplay or your support for your favourite teams in League - you are ultimately what attracts more people to this game, you are one of the reasons this subreddit has grown so popular - give yourself a pat on the back!\n\n**What's next for our team?** Well that is not confirmed yet, one thing for sure is we will be staying together, we will be participating in Season 3 EU Circuit and we will be staying in Cologne (Germany). We are going to knuckle down and take Season 3 head on, looking forward to it!\n\n--\nIf you would like to extend your thanks to someone\/people\/group that has made your year particular awesome  - feel free to post in the comments!\n--\n---\n*If you want updates on what me or my team is doing, feel free to find me on :*\n----\n---\n\n**Twitter:** https:\/\/twitter.com\/CLGsnoopeh \n\n**Facebook:** http:\/\/www.facebook.com\/snoopeh.lol \n","score":1343},"14":{"subreddit":"todayilearned","id":"15qnxt","comment_body":"I'm way more excited by the fact this may inspire someone to become Cagey. ","score_com":2,"title":"TIL there is a New York graffiti artist that replicates Banksy artworks while adding Tom Hanks face to everything- Calling him\/herself \"Hanksy\"","selftext":"","score":900},"15":{"subreddit":"todayilearned","id":"15qnxt","comment_body":"I'm way more excited by the fact this may inspire someone to become Cagey. ","score_com":2,"title":"TIL there is a New York graffiti artist that replicates Banksy artworks while adding Tom Hanks face to everything- Calling him\/herself \"Hanksy\"","selftext":"","score":900},"16":{"subreddit":"offmychest","id":"15qr3l","comment_body":"I'm also trying to get through school, and I'm also 22. You inspire me!","score_com":4,"title":"(860) 250-2386","selftext":"It's New Years Eve, i'm a 22 year old male trying to get through web design school. my moms a drug addict and takes pills from my grandmother while im recovering and trying to stay sober, my dad was severely disabled in a motorcycle accident, i didn't get a single gift for christmas from anyone, i have no money or booze, i've tried offing myself twice this year with sleeping pills, 3 nights ago my best friend found out i slept with his ex over the summer and won't talk to me, i havent eaten today because theres no food and i have no car or money, and i'm spending the night alone.\n\nsend me a picture, love letter, prank, hate message. i dont care, it's better than nothing. cheers and happy new year.","score":845},"17":{"subreddit":"Cooking","id":"15q5bn","comment_body":"Wow, OP!! Based on your comment, I see this is NOT your first twisted bakery delight.  What inspired you to start twisting?  This is absolutely amazing!","score_com":0,"title":"Tri-colored bread: pesto, sun-dried tomato, and kalamata olive","selftext":"","score":692},"18":{"subreddit":"askscience","id":"149848","comment_body":"Engineering|Biomedical Engineering\n\n*The majority of my research background is related to neuroscience and my past research projects include mapping visual pathway responses to RDKs (static and translating visual stimuli), using neural stem cell therapy for strokes, and investigating the therapeutic potential of transcranial magnetic stimulation (TMS) at a noninvasive medical device company. I have also researched cancer cell metabolism at a leading pharmaceutical company and I am currently designing a universal biomolecular sensor to fluorescently detect endogenous nucleic acids. \n\n*I also work for an outreach program dedicated to inspiring the next generation of students to improve people's quality of life through science and engineering! We give presentations and bring hands-on demos\/activities for the students to do such as building wind turbines and small circuits. \n\n*I am finishing my B.S. in Biomedical Engineering and I am currently awaiting admissions decisions for M.S.\/Ph.D. programs. \n\n*[Comment 1](http:\/\/www.reddit.com\/r\/todayilearned\/comments\/15skb0\/til_that_the_flashes_of_color_you_see_in_your_eye\/c7pn6s5)\n_Note: This comment is technically from a TIL post but it is what drew me to \/r\/askscience_\n\n*[Comment 2](http:\/\/www.reddit.com\/r\/askscience\/comments\/15s818\/would_anyone_be_willing_to_help_me_learn_some\/c7pnxem)","score_com":1,"title":"AskScience Panel of Scientists VII","selftext":"**Calling all scientists!**\n\nThe previous thread is archived, but available for viewing [here](http:\/\/redd.it\/ulpkj). If you are already on the panel - no worries - you'll stay! This thread is for **new** panelist recruitment!\n\n**Please make a comment to this thread to join our panel of scientists. (click the reply button) **\n\nThe panel is an informal group of Redditors who are professional scientists (or plan on becoming one, with at least a **graduate-level familiarity** with the field of their choice).\n\nYou may want to join the panel if you:\n\n* Are a research scientist, or are studying for at least an MSc. or equivalent degree in the sciences.\n\n* Are able to write about your field at a layman's level as well as at a level comfortable to your colleagues and peers (depending on who's asking the question)\n\nYou're still reading? Excellent! Please reply to this thread with the following:\n\n* Choose **one** general field from the side-bar. If you have multiple specialties, you still have to choose one.\n\n* State your specific field (neuropathology, quantum chemistry, etc.)\n\n* List your particular area of research (carbon nanotube dielectric properties, myelin sheath degradation in Parkinsons patients, etc.)\n\n* Give us a synopsis of your education: have you been a post-doctoral research scientist for three decades, or are you a first-year PhD student?\n\n* Link us to one or two comments you've made in \/r\/AskScience, which *you* feel are indicative of your scholarship. If you haven't commented yet, then please wait to apply. We'd prefer it if the comments have a reference, so we can more easily check if it's B.S. without specific domain knowledge.\n\nWe're not going to do background checks - we're just asking for Reddit's best behavior here. The information you provide will be used to compile a list of our panel members and what subject areas they'll be \"responsible\" for.\n\nThe reason I'm asking for comments to this post is that I'll get a little orange envelope from each of you, which will help me keep track of the whole thing. These official threads are also here for book-keeping: the other moderators and I can check what your claimed credentials are, and can take action if it becomes clear you're bullshitting us.\n\n*Addendum:* Please don't give us too much of your personal details. We don't need it, we don't even want it; please be careful and maintain your reddit\/internet privacy. Thanks!\n\n**Bonus points!** Here's a good chance to discover people that share your interests! And if you're interested in something, you probably have questions about it, so you can get started with that in \/r\/AskScience. Membership in the panel will also give you access to the panel subreddit, where the scientists can discuss among themselves, voice concerns to the moderators, and where the moderators can talk specifically to the panel as a whole.","score":582},"19":{"subreddit":"battlestations","id":"15qeeu","comment_body":"When I saw the title I was repeating in my head \"Please, no Razer...\" When I saw that you have a Ducky instead of the usual BlackWidow, my heart was uplifted. White LED quacker (blues) reporting in!","score_com":1,"title":"The Green Machine - Winter Update","selftext":"","score":562},"20":{"subreddit":"confession","id":"15o738","comment_body":"Its nice to see an uplifting confession like this one.","score_com":2,"title":"I'm thirteen and am making over minimum wage from design by appearing as a 22 year old male.","selftext":"I'm obviously using a throwaway to conceal my identity.\n\nI'm currently thirteen years old and have been using the same pseudonym online for two years appearing as 22 year old male. It started when my parents bought me a laptop at the age of 7. My dad, being a designer, gave me a license for whatever version of Xara that was out at that time. I taught myself how to use it well enough that he started using my designs for a few of his clients. Fast forward to age 11, my computer brakes with no chance of fixing it. Now knowing Java, HTML 3, and CSS, I'm devastated, but I move on.\nStill having ALL of the money that my dad paid me for basically doing his job, I buy a new computer and a copy of Adobe Photoshop. I quickly, as I did previously, learn it inside and out within about a month, though this time I went to Youtube for tutorials on things I wasn't able to figure out. With my parents permission, I started using a fake name and began asking whoever had a bad logo\/whoever was looking for a new logo if I could redesign it for them. After a few months of this, I had a solid and sizable portfolio.  After asking my dad how I could have people write checks to my fake name, he got me paperwork and we filled it out. If I'm correct I could be written to as \"Real Name operating under Fake Name\" or \"Fake Name\". So now, I design for some moderately big companies and will have made just below (not including taxes) $30,000 at the age of thirteen from graphic\/web design. Also, I put most of the money in the bank to save until I'm out of college. \n\nHaving this secret and not being able to tell anyone about it has caused many sleepless nights (like this one). I wrote this in hope that I can feel some kind of relief.\nHave a nice day\/night everyone!\n\n(Edited)\nNotes:\nI'm male\n","score":487},"21":{"subreddit":"minimalism","id":"15nmo0","comment_body":"Similar situation. Hoping with all my heart that I'll be you in a few years instead of standing with my brother next to seven junk trucks in thirty years. Just wanted you to know that your post inspired me to clean my own place after slacking for a couple months. Thanks.","score_com":1,"title":"My mother was a hoarder. She lived in the house for 30 years before I moved in. This is the story of our recovery to cleanliness and simplicity.","selftext":" My mom is my best friend, a brilliant student, a gifted psych nurse, and an incredible sweet beautiful person, but good grief the house. She's healthy, smart, kind, and funny, but oh god the house. Words fail. It's on a half acre of trees and her hoarding covered the whole lot. inside and out. The city sent blight notices and threats of fines and things were escalating.\n\nShe was always what we would call, \"cluttery\" - picking up things like golf balls, pretty glass, or unusual stones on a walk. But she also took my great-grandmother's lessons from the Depression and her own youth in poverty to heart - so she hoarded rubber bands, prescription bags, envelopes, paper (Oh god the paper), etc. She was a psychiatric nurse specializing in pediatrics, she is a literacy tutor, self-taught mystic and botanist, and origami teacher - so there was paper, thousands of books, bag after bag of toys of all kinds, medical texts, everything you could possibly imagine. She loved to shop at Goodwill and yard sales when she was lonely, bringing home stray furniture, clothes, toys, and always stacks of books. Ten years ago my dad died and in her grief things got much worse. It took years for her to recover, and eventually she bought a little house in the woods to retire to. \n\nMy mom moved to a small hippie community in the woods and once there her social group grew, she became more active and healthy, her heart began to heal, and she stopped her compulsive buying. Once she was secure there she gave me permission to clean up the house. She said she wanted to clean up but was totally overwhelmed and didn't even know where or how to start.\n\nWhen I moved in two years ago, each room had a corridor through the six foot high collections and trash through which you could navigate very carefully. The lights were out, the wallboard unfinished, the house stank of cat and dog urine. The yard was incredible, the trees overgrown, the house was in ruins.\n\nMy boyfriend and I have worked so hard the last couple years. I started outside so the city would get off my back. I mulched the yard in two feet of wood mulch to smother the grass, went crazy with my saber saw on the trees, and my boyfriend and I did dozens of dump loads in his truck. We divided the yard into sections and just started throwing away everything that wasn't essential. I built a big cinderblock firepit and we had burns every weekend for the heaps of wood and paper. That took most of the first year. We lived in the back room sleeping on top of the spa on a mattress, no other room was liveable. \n\nThen I started in the house. I set a goal of one room per month, but had to scale back to two rooms per season because the city limited what I could put out for trash at one time and sent me letters if I put the trash in my driveway in between pickups. Local scrappers took furniture and metal. The school up the road got boxes of books, paper, and art supplies. The firepit and garbage and recycling bin got more than I will ever admit. \n\nI put in place a couple of rules:\n1. If it doesn't get used in six months, it's gone. \n2. No furniture unless it's quality, and only if needed. \n3. I have to be able to keep up the house by myself- so the simpler the better. \n4. No upgrades- just stripping away, repairs, and cleaning. (preventing Money Pit Syndrome.) Drywall is being built, fences, bright new lights, new paint - room by room I'm fixing it up, simplifying, baring down to something simple and clean. The yard is better and better, the house has beautiful bones and is so bright and pretty now. It's still an old house, but it's a sane house finally.\n\nMy mom comes to visit a few times a year and is so thankful to me. I don't have to pay rent. :) I just keep cleaning and simplifying the house, throwing things away and cleaning and painting as I go. She has a house now, we have a working hot tub, a woodshop, a metal shop, a little forge and garden, the animals are clean and healthy, the yard looks great, we can have guests over, and I can keep up with it. There's still a lot to do, I have a five year plan. My goal is to be able to rent or sell the property if I want to move. The way it was it might have been scraped or condemned and it's a beautiful old house.\n\nI'm writing this because I just kind of finished - I cleaned out my mom's room yesterday. It took seventeen trash bags. I've never seen her room look like this in my life. This was the last room of The Crazy, and I fought to keep her photos and tchotchkes preserved while stripping and cleaning it. When she comes in a few days it will be my surprise to her - her personal space is big, bright, clean and liveable now. I can't wait to see her face.\n\nMinimalism isn't just a philosophy to me - it'a love letter to my mom, a renewal of a valuable material resource, a battle against my mom's grief and loneliness, and  part of my mission to better myself and my family so we can have a good future. We're winning with every room cleaned and emptied. One of the rooms is our own bright clean little bedroom now.  :)\n\nThanks for reading. ","score":414},"22":{"subreddit":"Minecraft","id":"15qgd0","comment_body":"I'm assuming an unexpected journey inspired op to make this. I finally seen it today and it was amazing","score_com":1,"title":"Made myself a hobbit hole :D","selftext":"","score":394},"23":{"subreddit":"TwoXChromosomes","id":"15qxsy","comment_body":"It's already 2 hrs into the new year, but I figured I'd answer. I spent NYE at home with the parents, while my siblings went out. I'm on crutches after a recent ankle surgery, so I couldn't go anywhere. Like you, I'm home from college and don't have any friends in the area, so no home visits. It really can get lonely.\n\nAdmittedly, I spent a lot of the night sulking in self-pity - not just about the fact that I'm a 21yo sitting at home on the biggest party night of the year, but also because this crutch situation will be with me for another 3 weeks, followed by 5-8 more months of a walking boot\/physical therapy. It sucks because I'm going into my final semester of college, and it's hard not to feel like my ankle surgery has ruined it for me. I felt a little better toward the end of the night, enough to cheer when the clock struck twelve, but I know I'm going to struggle a lot with this feeling of sadness over the next few months. At least I'll have my college friends to help me through the darker times. But I'll cross that bridge when I get to it.\n\nSorry for being a downer; I just needed to vent a little. I'm so happy for you that you're going on to pursue your dream! It's very inspiring. Keep up the passion, and happy new year!","score_com":1,"title":"Anyone else spending NYE alone?","selftext":"I'm home from college and don't really have any friends in my hometown.   I miss my college friends a lot and I'm going to spend the night with Netflix and beer.  In spite of how lonely I feel this night, I'm looking forward to 2013.  I have one more awesome semester, and then I'm moving to DC to enter a graduate program where I'll begin to pursue my dream of becoming a teacher :)  What are you ladies doing tonight?","score":348},"24":{"subreddit":"Fitness","id":"15qraz","comment_body":"Kudos, you look amazing! Do you find that as you get older your body responds to excercise differently? As a female who did a lot of strength training in my 20s, I found even with supplements I didn't really start getting great definition until my 30s. Thank you for inspiring me to get back into my routine!","score_com":5,"title":"Pre-Geezer (M, 47) work in progress.","selftext":"Thanks for all the help Fitt.\nHappy New Years to all. \n\n[Male, 6’- 0, 47 years old, 167lbs](http:\/\/i.imgur.com\/383s7.jpg).\n\n\nDiet - Vegetarian most of my adult life. Don't drink or smoke cigarettes. \n\n\nWeight - 148lbs August 2012  -&gt; 167lbs January 2012.\nStarted with an empty bar doing Stronglifts, 3 times a week (57 lifting sessions) . \n\n\nCurrent Stats for 5x5 \n\n\nBench 170\n\nSquat 230\n\nDeadLift 300\n\nOHP 130\n\nWeight lifting goals. Just squeaked into the 700 lb. club. Longer term goal is to join the 1000Lb Club before I turn 50.\n\n\nI did the SL routine. There is a Stronglifts app. ios) which was really helpful keeping me motivated and on track. Started working out in my local gym. Later, I Craigslisted some weightlifting equipment for a home-gym. Suits me better. I have started adding weighted dips and pull-ups and an ab wheel. My squats started to stall at 5x5 changed to 3x5. Feels good.\n\n","score":347},"25":{"subreddit":"Minecraft","id":"12kivd","comment_body":"I love this map and was inspired to make my own. It would be of great help if I knew what programs were used.","score_com":1,"title":"Herobrine's Mansion - Adventure Map! ","selftext":"","score":314},"26":{"subreddit":"AskReddit","id":"15qkxc","comment_body":"We did a lot of pranks.\n\nOur grade wasn't particularly good looking, our average grade was low, we didn't do sports or arts spectacularly, and, just in general, we didn't stand out. So a large amount of us decided that if we wanted to leave a mark in our school, we would do it through pranks.\n\nThe first was headed by this one guy. He gathered a bag full of dog shit, and told every senior to leave class at a certain time. We left, and locked windows and doors from the outside, and fled the scene. The guy had packed the bag into a cafeteria microwave and set it for 3 minutes. We hear that it smelled absolutely horrid. This was the fall back plan of the original plan, however. We were originally going to set a bunch of skunks free in the school and lock everybody inside, but the skunks escaped before we could use them.\n\nThe second prank was done by the artsy group, which included me. We sneaked into the school after it had closed, and painted the windows of the office in black and red, and I drew a small comical thing of Hitler. The school raged, of course, which made us want to go a step further, and change all the flags in the school into swastika flags. Though we acquired a few swastika flags, we never really got around to doing that prank.\n\nThe third was inspired by us. A bunch of guys sneaked into the school a month or so later, and the painted every single locker with either pink, orange, or black. They then greased up the floors, and painted \"Grad 2009\" on the wall of the main gymnasium.\n\nThe fourth was relatively simple. It snowed early that year, and by a crapload, so we just packed all the snow on every door, chained up the main entrance and packed snow up to the door handles. The result was a satisfactory day off while the custodians and teachers cleared the doors.\n\nThe last one was just childish and a little boring. We just downloaded a shit-ton of porn onto every school computer, made the home page a gay porn website. The wallpaper was also gay porn, and the screen savers were gay porn. It affected the library the most, and for most of the day the computers were unavailable for use.\n\nI heard that a lot of crap was done at the prom, but I didn't really see what they did. However, according to students still in our high school, a great deal of school events are permanently discontinued because we were such douchebags.\n\nOh, and those pranks were just the ones I either helped do or was at least indirectly in on. Through a few of my friends I learned there were a lot of minor ones that I don't know about. We also planned on putting anal lube in cafeteria food, but decided it was too weak and boring. We didn't even know what that would do. It's not like we knew what anal lube tasted like.","score_com":0,"title":"What was your senior prank?","selftext":"","score":304},"27":{"subreddit":"worldnews","id":"15q0a5","comment_body":"Good for them; Christian Bale wasn't able to get past security when he went to see Chen Guangcheng.  It's inspiring to see how \"Tank Man\" , and brave, Chinese dissidents can be.","score_com":-1,"title":"Chinese dissidents in rare visit to Nobel laureate's wife: A small group of Chinese dissidents forced their way past security guards last week to visit the detained wife of Nobel Peace Prize winner Liu Xiaobo and deliver a message of support","selftext":"","score":255},"28":{"subreddit":"EarthPorn","id":"15q9cv","comment_body":"Most inspiring!!","score_com":2,"title":"Sunset Cliffs, San Diego, California - (1920x1080)","selftext":"","score":248},"29":{"subreddit":"happy","id":"15q8cb","comment_body":"This is a great desktop background! Perhaps it will inspire me...","score_com":3,"title":"Make 2013 Count!","selftext":"","score":193},"30":{"subreddit":"GamePhysics","id":"152k68","comment_body":"fuck yes, burger paul. Fun fact, his BF3 EOD bot inspired my name.","score_com":1,"title":"Oh, Poonikins","selftext":"","score":181},"31":{"subreddit":"tonightsdinner","id":"15qcyz","comment_body":"You inspired my end of the year meal.\n\n It was delicious, but not nearly as pretty. Thank you nonetheless!","score_com":2,"title":"What my version of a stir fry looks like when I'm buzzed and hungry.","selftext":"","score":153},"32":{"subreddit":"Homebrewing","id":"15qngg","comment_body":"Glorious! I am contemplating brewing on Thursday when the high is projected to be 24F, you have inspired me :)","score_com":3,"title":"Sub zero temps can't stop this brewmaster!","selftext":"","score":153},"33":{"subreddit":"edmproduction","id":"15qftc","comment_body":"Hey Brian--absolutely love your work. The production quality is inspiring to say the least, and I'm humbled to think that everyone has the same 'sticking points'--regardless of how far along they are. \n\nI have 2 primary questions:\n\n1- As a producer myself, I too am trying to keep my eggs in many different baskets. But, how do you ride out the general financial instability? Did you have work that you could 'count on'? And ultimately, once you were confident in your abilities, how did you start finding well-paid work? I feel as though I'm almost on the cusp of something, but need a little bit more time!\n\n2- What is your average signal processing chain for a sub? Whilst I've developed numerous sounds, yours seem to cut through better. I'd be interested in how you approach making these sounds, and if\/how you use plugins like Ren Bass, etc. \n\nThanks again. Love Ninth Wave. ","score_com":1,"title":"I am Brian Trifon of Trifonic, Ask Me Anything about EDM Production","selftext":"","score":137},"34":{"subreddit":"conspiracy","id":"15qehs","comment_body":"http:\/\/www.3quarksdaily.com\/3quarksdaily\/2009\/03\/america-the-cold-war-and-the-taliban.html\n\nThis essay was inspired by Good Muslim, Bad Muslim by Mahmood Mamdani, Herbert Lehman Professor of Government and Professor of Anthropology at Columbia University. Most facts and figures are from his meticulously researched book which carries detailed notes and citations.\n\n[1] Mahmood Mamdani, Good Muslim, Bad Muslim, p.64.\n\n[2] ibid., p.66. (Inside quote by Alfred W McCoy, 'Fallout: The Interplay of CIA Cover Warfare and Global Narcotics Traffic,' 2002.)\n\n[3] ibid., p.103. (Source: Kornbluh, \"Nicaragua\", in Low-Intensity Warfare, pp.142-46.)\n\n[4] ibid., p.91. (Source: Minter, 'Apartheid's Contras,' pp.4-5.)\n\n[5] ibid., p.122.\n\n[6] ibid., p.122.\n\n[7] ibid., p.119.","score_com":1,"title":"These gentlemen are the moral equivalents of Americas founding fathers - Ronald Reagan, 1985","selftext":"","score":136},"35":{"subreddit":"NoFap","id":"15qqb6","comment_body":"Well done sir. You inspired me to dig out my old laptop and delete all the porn I had on it. That was the last one!","score_com":1,"title":"Just deleted about 190GB of porn from my laptop.","selftext":"I am switching back and forth between a huge feeling of relief and a large sense on loss. ","score":126},"36":{"subreddit":"eatsandwiches","id":"15gs53","comment_body":"fucking INSPIRED sandwich","score_com":2,"title":"lamb, jalapeno cheddar, padron peppers, red onions, romano lettuce, and philadelphia cheese. served on toasted sourdough.","selftext":"","score":125},"37":{"subreddit":"AMA","id":"14wmxm","comment_body":"This is an impressive thread. I saw [this comment](http:\/\/www.reddit.com\/r\/AMA\/comments\/14wmxm\/for_the_past_18_years_my_hobby_has_been_the_study\/c7h85j4) where user wtf_shroom asked if you have considered formally teaching in the subject area at a college\/university. I think that people as wealthy as you with the gift of inspiring the imagination, and ability to encourage people to do their own research would be well fit to be a teacher. It is clear to me in this thread that your passion about this subject is a wonderfully strong force that I'd like to encourage.\n\nI saw at one point you mentioned in a matter-of-fact way that drug use was a part of your life. I'm curious as to what your thoughts are on the tendency of the human mind and maybe particularly the drug induced mind, to be apt to pattern recognition. Especially when it relates to mythologies and archetypes, it seems that this pattern recognition mechanism is in overdrive, seeking to mentally resolve the salient subject: the mythology or archetype in question. Given the depth of research you have done and the corpus of stories that float around in your mind, what is your perception on this pattern recognition mechanism of the mind as it relates to either your own decisions and beliefs regarding this subject -- or to us collectively? In addition how do you see the alteration of this mechanism as a result of drug use?\n\nAfter reading a good majority of the comments in this thread, I got to thinking how incredible it would be to have a timeline style global visualization of the general sequence of events and a visual representation of the spread of the world's stories and mythologies. Imagine Google Earth, including a geographically accurate early-Earth (to our best understanding) and data for the various communities and civilizations over time, including: mythologies, texts, cultures, nations, island-bridges, and locations. I have several philosophy of religions texts that have some basic timelines of the influence of religions, but one like this constrained on a map and regarding the subject of mythology would be amazing. Have you come across anything even remotely like this kind of timeline for this subject? \n\nI, along with several other people, was looking for reading recommendations to approach this massive subject. Here is your comment with the [reading recommendations](http:\/\/www.reddit.com\/r\/AMA\/comments\/14wmxm\/for_the_past_18_years_my_hobby_has_been_the_study\/c7hf1ks) for others -- Thanks for that!\n\nThanks for making this thread it's been a great read and an inspiration for me to get back to one of my neglected passions. Hope you will consider your ability to influence our collective story.","score_com":1,"title":"For the past 18 years my hobby has been the study of ancient mythology and its links to modern theological beliefs. AMA","selftext":"I am *not* a professional and I can't think of any proof to give to mods other than the answers I provide to your questions. \n\nFor nearly two decades now I've spent most of my spare time studying ancient mythology, my interest initially piqued by Sumerian culture but soon developing to encompass the myths of many subsequent races and cultures and then later to determining the bridging gaps between modern theology, modern belief systems\/religions and their origins in Babylonian myth. \n\nThis is a big subject and my knowledge is, by no means, exhaustive but ask away and I'll do my best to answer your questions.\n\nEdit: Thanks for all your questions. I'll be away for some of today but I'll try to pop back in to answer new comments\/questions as and when I can.\n","score":123},"38":{"subreddit":"Sherlock","id":"15jye3","comment_body":"The scene in the tunnel from The Blind Banker definitely gave me a Batman-like vibe. Inspiration mimicking the inspired I suppose.","score_com":1,"title":"Sherlock as... Batman!","selftext":"","score":123},"39":{"subreddit":"Games","id":"15qnrb","comment_body":"Lost Odyssey - the Thousand Years of Dreams short stories. Inspired me to become a writer. Seriously, seriously beautiful. Probably the best writing I've ever seen in a game. ","score_com":2,"title":"What moment or level in a game has left the greatest imprint on you?","selftext":"I've had many memorable moments in gaming. From watching my brother first get the master sword in Link to the Past, to watching Aeris get stabbed in the back by Sephiroth.\n\nHowever, I was recently thinking back on the zombie craze that started around 2008-9. Many could argue that the catalyst to this crazy was Left4Dead. First playing that game awakened this huge desire for zombie survival in so many gamers.\n\nI didn't read up on any of the hype, and at the time I was someone who didn't keep up with gaming news from any magazines or websites, I just browsed around gamestop every now and then and picked a title I liked. Needless to say, I went in to Left4Dead with a completely clean slate. All I saw on the box was that it was made by Valve, who I knew made half-life which was a game I loved.\n\nSo I loaded the game up and I feared my old computer wouldn't run it too well, but sure enough, being a valve game, it ran perfectly. So well optimized and so smooth I was shocked. So here I am, standing on a rooftop with three other guys holding shotguns and submachine guns. Then, one guy speaks up on the VOIP and says something along the lines of \"Follow me, stay close, and always close the doors behind you, because they come from behind too...\" I didn't even know who \"they\" were since the rooftop seemed pretty safe from enemies. Next thing I know I'm following this group of strangers through a whirl of shotgun shells and zombie guts as we tear through a narrow apartment building ripe with signs of struggle and chaos as the whole world went to shit.\n\nAll I could do was point and click my cursor at anything that shambled, exploded, leapt, pulled, or punched as we made our way to some destination I was completely unaware of. Finally, a big red door in the distance. Guy on the mic says \"Get inside and remember what I said about doors.\" Myself being the last one in (being my first time and all) I shoved away any remaining zombies, spun around, and slammed the door with my hands shaking over the keyboard.\n\nAll I could do was lean back in my chair and breath a deep sigh of relief. Having gone in to the experience completely unaware of what to expect, I just had my balls blown right off. I knew right then that everything was going to change.","score":114},"40":{"subreddit":"Games","id":"15qnrb","comment_body":"A good introduction is what really does it for me. The first level of Halo 3 is one of my favorites since aside from briefly playing a few games here and there, it was the first next-gen (current gen now) I played. Even though Halo 3 looks like bollocks compared to what we have now, gunning through the jungles of Africa with the Arbiter on a big HD TV was awe inspiring at the time.  \n\n\n\nFallout 3 is another game where the intro was mind blowing. Even with my piece of shit graphics card, stepping out of the vault and seeing the wasteland was one of the greatest feelings I've ever had in a videogame.  \n\n\n\nThe first level of Pikmin 2 was another great opening that really sticks out in my mind. Even though it isn't particularly special, it's the fact that it was the first time I had ever played a next-gen game (last gen now). Before playing Pikmin 2, I had pretty much no exposure to modern (2005) gaming. I had no internet and I wasn't subscribed to any game magazines so I had no idea what to expect. In fact, I had no idea what the hell Pikmin 2 was about. The only reason I bought it was because it was $50 and in my mind that meant it was obviously a good game (luckily I was right). So just like Halo 3, when I first crashed into the Valley of Repose (now that I think about it, both games begin with crashing landing onto Earth) my mind was blown by the how everything looked.   \n\n\n\nAfter writing all that I feel like I should have some sort of closing statement, but fuck it I'm tired.  ","score_com":2,"title":"What moment or level in a game has left the greatest imprint on you?","selftext":"I've had many memorable moments in gaming. From watching my brother first get the master sword in Link to the Past, to watching Aeris get stabbed in the back by Sephiroth.\n\nHowever, I was recently thinking back on the zombie craze that started around 2008-9. Many could argue that the catalyst to this crazy was Left4Dead. First playing that game awakened this huge desire for zombie survival in so many gamers.\n\nI didn't read up on any of the hype, and at the time I was someone who didn't keep up with gaming news from any magazines or websites, I just browsed around gamestop every now and then and picked a title I liked. Needless to say, I went in to Left4Dead with a completely clean slate. All I saw on the box was that it was made by Valve, who I knew made half-life which was a game I loved.\n\nSo I loaded the game up and I feared my old computer wouldn't run it too well, but sure enough, being a valve game, it ran perfectly. So well optimized and so smooth I was shocked. So here I am, standing on a rooftop with three other guys holding shotguns and submachine guns. Then, one guy speaks up on the VOIP and says something along the lines of \"Follow me, stay close, and always close the doors behind you, because they come from behind too...\" I didn't even know who \"they\" were since the rooftop seemed pretty safe from enemies. Next thing I know I'm following this group of strangers through a whirl of shotgun shells and zombie guts as we tear through a narrow apartment building ripe with signs of struggle and chaos as the whole world went to shit.\n\nAll I could do was point and click my cursor at anything that shambled, exploded, leapt, pulled, or punched as we made our way to some destination I was completely unaware of. Finally, a big red door in the distance. Guy on the mic says \"Get inside and remember what I said about doors.\" Myself being the last one in (being my first time and all) I shoved away any remaining zombies, spun around, and slammed the door with my hands shaking over the keyboard.\n\nAll I could do was lean back in my chair and breath a deep sigh of relief. Having gone in to the experience completely unaware of what to expect, I just had my balls blown right off. I knew right then that everything was going to change.","score":114},"41":{"subreddit":"writing","id":"15pcsq","comment_body":"okay, lemme give it to you stright, unless your a genius everyone is god awful at writing when they start. I was inspired by eragon and boy was i shit. If its something you want to do (or NEED to do in my case) then the more you do it the better you'll get. having little notepads everywhere (in the bathroom, beside the bed, in the kitchen drawer, tacked to the wall) will help when you have an idea. the second you get the urge to write, do it.\n\nalso, homework is not writing, its like, bullshit. I would like to think im a fairly good writer but that doesnt mean i got good grades in english (oppisite really, i hated english) because english sucks balls. you want to be good at grammar you need to read and write and read and write and cry because someone told you that your baby of a story sucks and then get over it because being told you suck is worth the progress you make and the joy of writing.\n\nif you gotta write, nothing is stopping you.","score_com":1,"title":"I want to write. Please, read inside.","selftext":"Okay. I'm 17 years old and I've recently read '1984' and it inspired me so, so much, that I've been thinking of starting to write and I just can't put it in words WHY, but I really do.\n\nThing is, I've never been good at writing. I always get bad grades when I write homework, even though I feel satisfied when I write something and mostly it's the style and grammar mistakes that do me wrong. I've never written anything serious, nor a short story, nor any kind of story.\n\nSo I think what I wanted to say is, how do I overcome the fear of being really bad at writing, even though I want to write and actually make some sense. I think that's what I would actually like to do in life, knowing that I was a lazy ass all those 17 years. I'm scared of finally finding something I want to do and being bad at it.\n\nSo it comes to one question. Have any of you ever been in such a situation before starting to write? I would really like to hear your stories or anything else you've got to tell me.\n\nSorry if my English is bad and thank you for reading this.\n\nEDIT: I have got to say, you people inspired me so much! I'm no more scared to start!\n\nThank you for all the book recommendations, I'll be sure to check my library for all of them.\n\nI just can't say thanks enough! You're all great.","score":105},"42":{"subreddit":"tall","id":"15qp22","comment_body":"This girl is seriously hot, as well as athletic, and (while not overly inspired in her prose) educated enough to put complete sentences together with subject-verb agreement. I doubt she has trouble finding desirable suitors today.","score_com":1,"title":"Stumbled across this article by a lovely 6'4\" woman. It's a good, short read. ","selftext":"","score":90},"43":{"subreddit":"futurama","id":"15puh5","comment_body":"Your post inspired me to make [THIS GIF.](http:\/\/i.minus.com\/ibb2doBajsP3iZ.gif) I have not posted it anywhere but in this reply. It is yours to do as you please.","score_com":7,"title":"ಠ_ಠ","selftext":"","score":83},"44":{"subreddit":"BodyAcceptance","id":"157yn8","comment_body":"&gt;Everything you’ve experienced is stored in your body at a cellular level. Each cell is a record of all of it. I’ve felt it in your skin. Being born. Being held. The time you fell off your bike and weren’t that hurt but very scared. That brutal sunburn on your shoulders at 14. The time you fell out of a tree and broke your collarbone. The first time you felt deeply loved. The person who hurt you so badly you thought you were broken for good. Your muscles remember it. They remember it like it happened 10 minutes ago.\nYour successes hold your shoulders high. Your losses pull your chest inward. You hold your sadness in your throat, your anger in your jaw and your fear in your belly. Your happiness rises and falls in your chest. Love rolls in and out on the tides of your breath. It’s all there, all the time. {You can release the parts that hurt, if you want to. Yoga and massage are the best ways I’ve seen.}\n\nThat was gorgeous and inspiring. This part especially struck a chord with me, it's almost like she's saying our body is a capsule for our experiences and nothing more, be proud of it because you cannot truly hide it. Thanks for sharing.","score_com":3,"title":"\"Eight Things I learned from 50 Naked People.\" {massage therapy}","selftext":"","score":75},"45":{"subreddit":"AskCulinary","id":"15qiqx","comment_body":"Hey, thanks a bunch, guys. I had no idea I was so prolific.\n\nHopefully it's quantity AND quality. :)\n\nHonestly, this is one of my absolute favorite subreddits. The content is outstanding. The mods have always been a pleasure to deal with. The depth and breadth of knowledge available to tap into at any given moment is at once intimidating and inspiring.\n\nWhen I first got here, I was probably more on the intimidated side, feeling terribly out of my league and woefully ignorant, coming from a non-professional background with no formal training of any kind. Heck, the most I was taught about cooking, as I was growing up, was how to read and follow the directions on a box of Hamburger Helper.\n\nYears down the road, my tastes finally starting to mature, I start to realize that, hey, this vegetable thing isn't so bad. I should figure out how to do something more than just steam them for a side dish. Next thing I know, I'm burning and scorching my way through the kitchen, undercooking, overcooking overseasoning, ignoring recipes, and hacking away with grim resolve at any unfortunate food that had the bad luck to cross my cutting board\n\nFor a few months there, you'd think I was attending Académie de L'imbécile, Institute of the Culinary Arts for the Criminally Insane and Woefully Inept.\n\nThen, one fateful evening, I was preparing to defile a perfectly good recipe, that had never done anything to anyone and really didn't deserve the treatment it was about to receive, then feed the resulting carnage to the poor souls who have the unwavering courage, utmost dedication, or possibly some sort of brain damage resulting in them no longer having the primal fight-or-flight instinct to ensure their well-being, to call themselves not just my friends...but my dinner guests.\n\nThe fools.\n\nSo, there I am, looking over this recipe, and it calls for onions to be sauteed.\n\nMoment of clarity: I don't actually know what that means. I bet I could look it up on the internet.\n\nAnd lo, the heavens parted, choirs sang, and God looked down upon the dinner I had prepared sayeth unto me in all his glory, \"Well. That didn't suck.\"\n\nAnd thus began my self-education in the ways of making food that doesn't suck. Started with the basics and learned fundamental concepts. What is boiling vs simmering? What is braising vs roasting vs baking. What essential items should I always have in my kitchen?\n\nJust learning core concepts and putting them into practice stretched me for quite a while. Then I played with baked goods for a while, and then started playing around with dishes from other cultures that were outside of my comfort zone.\n\nThen I hit a plateau. I found myself frustrated that I had learned how to apply all these wonderful methods and techniques, but I didn't know why. It was skill without theory. I wanted a deeper understanding of the what\/how\/why of all these tasks I had learned how to perform.\n\nAnd then a friend introduced me to Alton Brown and Good Eats. So there's another year and a half or more of my life.\n\nFinally, early in 2012, I discover this little site called Reddit. There was the initial honeymoon phase of memes, nifty pics, jokes, and the typical front page material. I kept noticing this ad on the front page for some subreddit called AskCulinary. Braving this new world of meaningful content, I forged ahead and figured out how to subscribe. It was my first custom subreddit and the best decision I've made since joining the site.\n\nAfter a short period of lurking, getting a feel for posting guidelines, and waiting for the opportunity, I made my first post and was absolutely blown away by the response. People were friendly and knowledgeable. They knew the right questions to ask to get further detail from me so they could better assist me. There was a genuine interest in not just food, or recipes, or cooking in general, but in helping others to not just resolve their cooking issues, but educate them along the way, providing breakdowns of the science, explanations of theory, links to external relevant information, and a consistently positive attitude.\n\nIt's like having Alton Brown on-call for troubleshooting, education, and inspiration, pretty much 24 hours a day. Even at ridiculously late hours of the night, I don't think I've ever waited more than an hour for a response to a post.\n\nSo, yeah, I post here all the bloody time. You guys successfully got me through this last summer's project\/goal of learning how to grill, maybe not like a pro, but a hell of a lot better than most, and how to effectively use the grill as a smoker. It's something I've wanted to do for years and the AskCulinary crew played a major role in helping to facilitate the accomplishment of that goal.\n\nIf anyone actually bothers to read the entirety of this totally ridiculous, rambling, partially nonsensical comment, I hope that you come away with a sense that no matter what your current level of knowledge or amount of skill in the kitchen may be, AskCulinary provides an invaluable resource to enable you to become a better cook every day. Don't be afraid to ask questions. Don't feel like you're questions have to involve high end cooking or advanced techniques.\n\nThere are no Stupid Questions. There's just Questions You Forgot to Search for Before Posting. Oh, and remember to read the sidebar and posting guidelines, too.\n\nHappy New Year,\n\nHappy Cooking,\n\nand Happy Trails.","score_com":4,"title":"An r\/AskCulinary update\/reminder, r\/bestof2012 winners and new moderators.","selftext":"Hello \/r\/askculinary!\n\nWe hope you all had a happy holiday and more importantly, a happy holiday dinner!\n\nIn the last couple of weeks, we have seen five thousand new subscribers here--a 20% increase--and we would like to thank everyone for their interest in becoming a better cook. We hope you all find our community a great place to share culinary knowledge.\n\nWith our rapid increase in size we feel it would be beneficial to explain to the newcomers and remind our regulars what \/r\/askculinary is all about.\n\nWe are, as the title of the community states, here to share our knowledge and to help each other become better cooks. To accomplish this goal, we do have rules to encourage quality posts and comments. I would like to clarify and reiterate our rules and guidelines here.\n\n**Most importantly, we are not here for recipes.** There is nothing wrong with sharing your recipes, but there are better and larger subreddits like \/r\/recipes and \/r\/cooking that specialize in this sort of thing. If your posts primary goal is to receive a good recipe or to use a particular ingredient for a particular dish, you will be better off posting in either of those subreddits. Specific, detailed questions to which we can give specific, detailed answers serve our overall goals much more.\n\nIn addition, **casual culinary discussion and kitchen stories are better suited to other communities** such as\/ \/r\/kitchenconfidential, \/r\/cooking or \/r\/chefit. Posts asking for career advice, such as what school to go to or how to get into the industry are better suited to \/r\/kitchenconfidential or \/r\/chefit. Casual questions like, “What is your favorite thing to cook?” or “What is something cheap and easy to make?” are better suited to \/r\/cooking. These questions get better response in other more general communities.\n\nThere is also a new rule that we became aware of. **Any post that is asking whether or not a dish is safe to consume could be construed as medical advice. This is against Reddit's site-wide ToS and thus will be removed immediately.** I know it seems foolish to have to be this extreme, but it's important, besides which, there is only one appropriate answer to the question: \"If in doubt, throw it out\"\n\n**We have a great FAQ and archive to search of previously answered questions.** Please use these to avoid reposting questions that have been thoroughly answered. Yes, it is more fun to have a conversation, but frequently repeated basic questions is what drives people otherwise eager to help to rudeness and frustration.\n\nLastly, when posting, **please be focused and detailed**. Provide the recipe, your technique and exact procedures you followed and ask a question as specific as possible. The better your question is, the better our answers can be.\n\nIn terms of comments, while we are not a “pros-only” community, we do have a standard of what comments are appropriate, much like \/r\/askscience has. Firstly, we are a more “serious” subreddit than most.** Jokes, memes, puns and off-topic comments will be removed.** All comments must be accurate, well informed and either answer the questions fully, or add interesting discussion to the topic at hand. If your comment does not fulfill these goals, it will be removed**. Short, misinformed or vague responses are not appropriate here.**\n\nWe hope you realize why these rules are necessary and need to be enforced. With our numbers currently, we as a community need to be vigilant in self-moderation. Be sure to utilize the report function for anything you find inappropriate. We have also added two new moderators to the team here. Please welcome \/u\/cdnchef and \/u\/vbm923! We hope with your help we can beat the infamous “gradual degradation of a subreddit” and keep our community on track to accomplishing our goals.\n\nAnd lastly, r\/askculinary participated in the reddit \/r\/bestof2012 this year and are happy to announce this year’s winners! Congratulations to the following:\n\n**Best answerer** - \/u\/unseenpuppet because you guys are way too nice and\/or insane\n\n**Best answer** - \/u\/FlushStr8ed for his [pocket guide to Indian cooking](http:\/\/www.reddit.com\/r\/AskCulinary\/comments\/zz1xc\/whats_the_secret_to_making_awesome_homecooked\/c68yigz) \n**\n\n**Best question**- \/u\/ToughKitten for [The Lost Art of Hosting a Dinner Party](http:\/\/www.reddit.com\/r\/AskCulinary\/comments\/sfrpn\/the_lost_art_of_hosting_a_dinner_party\/) \n\n**Best question asker** - \/u\/grimfel for countless great posts\n\n**Best non-question post** - \/u\/cdnchef for the [Holiday Hotline](http:\/\/www.reddit.com\/r\/AskCulinary\/comments\/15f8wr\/reddit_we_are_here_for_you_today_its_the_ask\/)\n\n\nThank you for your great community participation! \/r\/askculinary would not be the same without you! You will be receiving your reddit gold shortly!\n\nThank you to everyone for a great first year here at \/r\/askculinary! It would not be possible without all of your loyal, smart and helpful contributors! Have a happy new year and cheers to an even better 2013!\n\nSincerely,\n\nThe\/ r\/askculinary moderating team.","score":68},"46":{"subreddit":"proper","id":"15qnz0","comment_body":"Indeed. It is far better to uplift others and risk failure than to scorn others and always succeed. You must provide encouragement, chaps, so that one day the world will voluntarily walk our path.","score_com":4,"title":"I wish to make a formal complaint.","selftext":"Dear Sir or Madam,\n\nI wish to make a formal complaint.  During my recent perusal of \/r\/proper I was both shocked and alarmed by harsh comments made on a multitude posts-- a large number of which contained snide jokes concerning people’s economic status in society.  In laymen’s terms, you have overused prejudiced and unfair terms like *peasant*.  \n\nAs we all know, one does not get to choose their place in our society.  It is because of the entitlements granted to us as the elite that we often look down upon others, but we must not stoop to such base levels of belittlement.  As gentlemen, and gentlewomen, we must rise above the rest and take a more couth means of approach. \n\nSo next time you feel the urge to demean someone for their misuse of grammar, or their inability to understand what is or is not proper, I think a simple downvote should suffice.\n\nRespectfully yours,\nasthelionsleeps","score":64},"47":{"subreddit":"startrek","id":"15phb3","comment_body":"I enjoyed VOY.  It hearkened back to TOS but thoroughly removed itself from becoming a TNG-clone.  \n\nWas it a good show?  I have trouble making those kinds of judgments.  I myself have never created a show for broadcast television, I'm just happy people are out there trying to get their science fiction-inspired art produced for a mass audience (corporate-forced compromises and all).  \n\nThere are a number of episodes I enjoyed:  Future's End, Message in a Bottle, Living Witness.  \n\nThe \"Janeway is bat-s**t crazy\" theory seems to be the prevalent one going around these days.  It makes sense in regards to her behavior.  I don't think it diminishes her character, as many notable luminaries throughout history have been a bit \"off.\"  And anyways, she did the best she could.  I wonder how Sisko would've have handled VOY's predicament (Or Kirk or Picard for that matter)?\n\nIt's Trek, so I love Voyager.  I don't think that it's the Holiday Special of the Trek world.","score_com":2,"title":"I see a lot of posts about how people disliked Voyager.  Is there any one out there like me who really enjoyed it?","selftext":"Perhaps the timing was just right.  I was young enough to love Star Trek, and it was the first time I was able to see a series from start to end without watching re-runs.\n\nI see people who dislike Neelix, while I actually loved his character.  Someone in a poor situation, trying to make the best out of it and to brighten the lives of the people around him, completely selfless.  I was young enough to enjoy the show without worrying about things such as 7 of 9 brought in to get more people interested in the show (cough).\n\nFor what it was; a group of people stuck in the middle of nowhere doing the best they could to stick together, work together, and make it back home.  I thought it was great.  I re-watched the entire series again, and while I can see different things I missed before, there's still that same love I had for it the first time around.  I'm not going to say it was perfect, it had some moments I didn't like.\n\nWho else liked Voyager, and doesn't want to nail it as \"one of the weaker Star Trek series\"?","score":62},"48":{"subreddit":"cringe","id":"15qlnh","comment_body":"I'm convinced that two thirds of all those meatheads out there teaching a martial art truly have no idea wtf they're doing. Nice to see these instances caught on video.\n\nIt's like going to a gym and having some fat out of shape dude offer to be a personal trainer (yes, it happens and often). It's like dude, if you can't even be bothered to keep yourself in shape, how are you going to inspire others to do the same?","score_com":4,"title":"Muay Thai Demonstration Fail ","selftext":"","score":56},"49":{"subreddit":"ZenHabits","id":"15ln8y","comment_body":"My girlfriend is that person and i'm so grateful for that everyday... Not only can I tell her my worries, and she will give me support, but also I can let her know about my projects and doubts, and she actually gives me her point of view and let me see other ways...\nAnyway, i also think that you should try to find people inspiring you, for example people who reached the dream you are trying to reach yourself ... My inspirating people are Leo Babauita, Tim Ferriss, Pat Flynn ... \n","score_com":2,"title":"Find someone who brings out the best in you.","selftext":"","score":55},"50":{"subreddit":"RandomActsOfGaming","id":"15qmcr","comment_body":"According to you I'm not qualified since I found out about reddit almost a month ago. BUT I will tell you about my favorite soccer team that I follow so faithfully. \n\nIt was back in 2001 when I was watching a Premier League match... Liverpool - Aston Villa  (1-3 just for the record), when I realized that I wanna support Aston Villa. I was so inspired with how our players played and managed to take the win even after been equalized 1-1 by Gerrard. Since then, I support The VILLANS, and I will support them till the end (Villa has given us - middle PL club fans - the joy of participating in Europa (and also winning a Champions League for older supporters)). \n\nThe past and current year, we are struggling to avoid relegation. We avoided relegation last year, and I was so pleased (we are one of the five Premier League teams that have never been relegated). This year we are struggling again but I have faith in Lambert's plan and in our players that they can do it. Even after conceding 15 goals in 3 matches and scoring none, this team can do it!!! \n\nUP THE VILLANS! GET IN THERE AND SMASH THE ENEMIES WE ARE WITH YOU!\n\n(Thanks for the giveaway nevertheless and Happy New Year to everyone!)","score_com":1,"title":"[Giveaway] $15 steam game","selftext":"I'm feeling excited for the new year in anticipation of the champions league (I'm a huge BVB fan) and feel like doing something nice. I will be giving away 1 $15 (or under) steam game to first place and 1 $10 (or under) steam game to second place. \n\nTo enter just tell me about your favorite soccer team or player and why you follow\/like them.\nOr if you don't follow the sport at all, just tell me a random story (preferably an interesting one) of something in your life. Also, your reddit account must be at least 3 months old and 100 comment karma as well as have a steam account so I can gift it to you.\n\nI will select the winners based solely on my discretion on what I find are the best submissions. I will read all submissions and don't worry, I won't give precedence to whether or not its about a soccer team or something from your life! I will message the winners asking what game they want.\n\nHope everyone had a merry Christmas and has an awesome new year.\nI will choose the winners sometime tomorrow, most likely after work so like close to midnight tomorrow.","score":48},"51":{"subreddit":"Parkour","id":"15qfxv","comment_body":"Thank for posting this. And I know this won't be seen by them, but thanks for making this documentary. Rarely do I feel so inspired. Screw you haters.","score_com":-2,"title":"1 hour Parkour documentary, Seriously worth the time.","selftext":"","score":45},"52":{"subreddit":"GlobalOffensive","id":"15qq02","comment_body":"No one will be able to share my nostalgia, but I loved playing the custom maps I made in 1.6 on LAN parties.\n\nI made a map where both teams started in pirate ship vehicles and their only weapon was a knife, and they could sail to islands where there was HE grenades. That meant the both pirate ships tried to board each other on the way to the HE grenade, and often someone got stranded on the other ship and had to be rescued by his captain.\n\nI also made a SAW (the movie) inspired map with many psychological puzzles that were very entertaining to play at LAN parties.\n\nExample: a room has a box that you need to be boosted up to. Up there is a button and a rifle. The button opens the next room, in which there's a dangerous path one player can take to allow all others to pass safely. If no one risks taking that dangerous path then they all need to take a semi-dangerous path.\n\nWhat often ended up happening was that the person who got the gun in the previous room forced one player to go the dangerous path to then pass safely himself. That of course meant people argued a lot about who was most trustworthy to get the gun. That gamemode was really fun. :D","score_com":1,"title":"The CS nostalgia thread","selftext":"Ok so we are slowly finishing off the year. Firstly, happy New Years everyone. This year has really sparked my love for CS back up, ill admit I was a 1.6er that just couldn't adapt to source. This year we have seen lots of decent tournaments and some nice updates from valve. \n\nWe all know there is plenty more to go but so far, I'm loving go. Thank you valve. \n\nSo, this got me thinking about the good old times and it brought back some real nostalgic feelings. So to reign in the near, lets remember the good old times. Let everyone remember the good old times of CS old and new. \n\nFor me:\n\n- CS assault. One of the good old maps. Remember entering top vents? BOOM 5 Terrorists spamming you in vents. Remember entering back squeaky doors? BOOM 5 terrorists spamming you again. \n\n- the music in CS Italy. \n\n- the various noises that gave away your positions on maps - lightening on   Bridge on Aztec. Same on steps. \n\n- sheep (I think) on cbbl. \n\nWhat about you guys? ","score":42},"53":{"subreddit":"52weeksofcooking","id":"15qnr7","comment_body":"Welcome dipthonggirl as mod! Great first intro post :)\n\nHappy new year from Australia! 2013 is great, you'll love it. I'm currently on my way to the beach!\n\nI've got an idea or two for appetisers, can't wait to jump into another year of cooking. Inspired by music has got me stumped though, glad I still have a couple of weeks to think about it :)","score_com":5,"title":"Week 1 Introduction Thread: Appetizers","selftext":"Welcome to 2013!\n\nThis week we're doing [Appetizers](http:\/\/en.wikipedia.org\/wiki\/Hors_d%27oeuvre)! aka Hors d'oeuvres. \n\nThis is definitely a category with lots of possibilities. \nAppetizers are meal starters, a first course, or food served during the Cocktail Hour. Sometimes I like to just get a few appetizers at a restaurant and share them rather than get individual entrees. Many of you will probably have some with champagne tonight to ring in the New Year. Will you make some fresh cut [Crudités](http:\/\/en.wikipedia.org\/wiki\/Crudit%C3%A9s) or a delicate Amuse-Bouche? Forks are optional!\n\nHere's a [list of recipes](http:\/\/www.epicurious.com\/tools\/browseresults?att=116) to get your juices (or drool) flowing.\nDon't forget to challenge yourself, but above all else, HAVE FUN! \n\nHAPPY NEW YEAR!!!!","score":41},"54":{"subreddit":"Warhammer","id":"15qtc4","comment_body":"Truely inspiring. I have to ask, what's with all the differently coloured Tac squads in the middle? Do you play them as one army?","score_com":2,"title":"Over 13,000 Points of Painted SM\/BA\/GKs. ","selftext":"","score":39},"55":{"subreddit":"Weird","id":"15bua7","comment_body":"I think Leo Tolstoy, John Muir and Henry David Thoreau should definitely be on this list. Those beards have inspired me really.","score_com":1,"title":"Top 10 crazy mustaches and beards (would YOU date wolf girl?)","selftext":"","score":35},"56":{"subreddit":"normalnudes","id":"15q9ml","comment_body":"This is inspiring to me - I'm near your height and starting weight.  What did you do?","score_com":2,"title":"My Weight Loss over the last five months.  Male (30), 6'1\", started at 220lbs, now at 180lbs.","selftext":"","score":34},"57":{"subreddit":"exmuslim","id":"15qhub","comment_body":"Happy New Year to all of you brave and inspiring people. All the best! ","score_com":3,"title":"2013","selftext":"I wish you all the best my friend :) Make this year fantastic. Much love.","score":33},"58":{"subreddit":"videos","id":"15qhlr","comment_body":"Here is a short film I made inspired by this! Hilarious TV show.\n\nhttp:\/\/vimeo.com\/28572228\n\n","score_com":1,"title":"This is Father Ted, an Irish comedy series that ran until 1988. It's a tradition that I watch the Christmas Episode around the festive season so I'm sharing it with you. Enjoy!","selftext":"","score":32},"59":{"subreddit":"NoFap","id":"15qbjc","comment_body":"Inspiring stuff.","score_com":2,"title":"I owe y'all a big thanks","selftext":"Just like many of you, I have fully committed to this lifestyle, and it started 49 days ago when i watched the TEDx video on porn\/fapping. I was wasting my time, energy and brain power and I made a choice.\n\nUntil now, I have been subbed to this subreddit and just read the posts here while I tried it out for myself, so I am happy to finally post here.\n\nI have been a guy who has had moderate success throughout my life with girls, mostly just kissing them though. I had never had a \"good\" sexual experience. I had been laid but nothing that i knew it could be. I decided that this could help my confidence and keep my going strong when I was having sex, as i had had problems of moderate ED in certain sexual situations that i was positive were linked to nerves and lack of confidence. Confidence that I was constantly diminishing with the porn i watched.\n\nI have not fapped or even glanced at any porn for nearly two months and i have made some massive strides. I met a girl who I fell in love with and I couldn't be happier with her. We have been seeing each other for around 3 or so weeks and have had sex numerous times, all with strong performances on my part. Since nofap, and meeting her, I have watched *everything* in my life just **get better**.\n\n Promoted at my job, stronger and healthier than ever in the weightroom, starting to get back on the mat after a few months of absence (BJJ), and finding myself being able to put up with\/get along with my crazy family when I am home. I wake up with a smile and I am grateful for every moment I get.\n\nI am sure that this amazing girl in my life has made me all the happier and more motivated but I know that it all started with getting out of my comfort zone, going nofap, and taking this awesome step in a truly victorious attempt to better my life.\n\n\nI want to commend all of the awesome dedicated people on this subreddit. Every single one of you taking this venture are the epitome of ambition. You all want to improve yourself and it is contageous. For those who aren't sure about this, I'd tell you that giving it a try absolutely can't hurt, and it just might change your life forever. Happy New Year, and to those trying this for the new year, you can do it!\n\n Thanks everyone, love y'all.\n","score":30},"60":{"subreddit":"LiverpoolFC","id":"15qz58","comment_body":"Wow, this is a wonderfully inspiring, and not tremendously inaccurate, portrait of Suarez as a very effective anti-hero.  I like it.  LFC are lucky to have such a character.","score_com":4,"title":"Strange as it seems, Suarez has become a model, modern hero. The Uruguayan always plays as if the fate of the world depends on his next move","selftext":"","score":29},"61":{"subreddit":"worldnews","id":"15qyrf","comment_body":"Just watched [Pandora's Box](http:\/\/topdocumentaryfilms.com\/pandoras-box\/). The segment on Ghana was pretty fascinating. It is inspiring to see an African country that has fought so hard to modernize itself and managed to combat western corporate exploitation in some small measure. And their commitment in implementing progressive policies such as this shows they are continuing to move in a good direction. ","score_com":0,"title":"Ghana bans second-hand fridges:  A ban on the import of second-hand refrigerators is coming into force in Ghana to reduce energy consumption and harm to the environment.","selftext":"","score":28},"62":{"subreddit":"gaybros","id":"15qggz","comment_body":"According to Last.fm, my most played track was [Steep Hills of Vicodin Tears](http:\/\/www.youtube.com\/watch?v=1h_rtoSbbe0). I'd say it actually sums up the year quite nicely. Nothing particularly grandiose, but still somewhat uplifting.","score_com":1,"title":"Gaybros, what song describes your 2012?","selftext":"AKA if your year had a theme song, what would it be?\n\nMine would be [*This Year* by The Mountain Goats](http:\/\/www.youtube.com\/watch?v=ii6kJaGiRaI). \"I am gonna make it through this year if it kills me.\"","score":27},"63":{"subreddit":"Hedgehog","id":"15on2d","comment_body":"I'm sure Renly would say Hello and Thank you to everyone if he weren't sleeping in his snuggily after running around in his ball for about half an hour. \n\nIt's nice to know there is a a group of people with Game of Thrones\/ Song of Ice and Fire name inspired hedgies.","score_com":2,"title":"Reddit, meet Renly Baratheon.","selftext":"","score":27},"64":{"subreddit":"Bandnames","id":"15dzip","comment_body":"Was this in any part inspired by the Russian \"lost cosmonauts\" stories? very cool name.","score_com":1,"title":"The Lost Cosmonauts","selftext":"","score":27},"65":{"subreddit":"furry","id":"15qlnn","comment_body":"I have been on SL since 2008, and I enjoy it for the aesthetics, the community and the music (dance clubs). I have had virtual sex encounters,  but I still have far more RL sex with my RL mates. (though some RL sex may be inspired by SL) ","score_com":1,"title":"I Think Quite A Few Of Us SL Furs Can Relate.","selftext":"","score":25},"66":{"subreddit":"wow","id":"15q3e8","comment_body":"I grew pretty tired of my mistweaver.  I think it's the renewing-mist and uplift combo that gets to me.","score_com":1,"title":"So what is the verdict on monks?","selftext":"I am curious to see what every ones verdict on the monk class is thus far. Has anyone committed to making it their main? If so why and in which areas do you excel?\n\nThe reason I am asking is because I have had some fair enjoyment from playing mine thus far (level 80) I am very interested in knowing how well they do as DPS in PVP. I currently main a mage but am interested in having a melee class and as of now I am leaning towards either a rogue or monk. (rogue simply because they feel like the melee version of a mage)","score":24},"67":{"subreddit":"wow","id":"15q3e8","comment_body":"I'll outline some stuff for mistweavers, as I've been raiding on one since the beginning of MoP. and I see very few people posting that have been doing progression.\n\nAoE healing is extremely strong. People do not recognize the usefulness of Thunderfocus tea, which allows us to renew all of our Renewing Mists on players. Uplift is insane if you can get the chi procs from soothing mist or jab.  Spinning crane kick is shit now though, and is only useful on burn phases where it's feasable to stack.  The mana cost is simply too high, with little return on Chi.\n\nTank healing is decent. Life Cocoon is an amazing CD, but it's hard to figure out when to use it unless your tank is extremely vocal about cooldown rotations. Surging mist is a mana dump, so it needs to be avoid at all costs unless you feel like going for the free surge from spamming tiger palm. (not worth it seriously, the jab cost is insane high). Enveloping Mists is a great heal, but you need to grab the chi for it extremely fast if it's needed. Generally I can get soothing mist to proc enough for it.\nTLDR; Monks need to keep tanks topped off at all times to be at all viable. Cocoon is the only mana efficient recovery method.\n\nUtiity is shit. Revival is a nice cooldown, but it's sudden, and it's used to keep the lowest in health from death. At times, that means overhealing others by 33%. \n\nSingle target healing is extremely viable. Far better than healing wave, heal, etc. It can't overheal. It's almost impossible.\n\n\nPLaying a monk properly is a huge skill gap. You need to manage a lot of different mechanics, and mana consumption is one of them. If you figure out how to burn chi at the right moments, you'll do great.\n\n\n\n\n\n","score_com":1,"title":"So what is the verdict on monks?","selftext":"I am curious to see what every ones verdict on the monk class is thus far. Has anyone committed to making it their main? If so why and in which areas do you excel?\n\nThe reason I am asking is because I have had some fair enjoyment from playing mine thus far (level 80) I am very interested in knowing how well they do as DPS in PVP. I currently main a mage but am interested in having a melee class and as of now I am leaning towards either a rogue or monk. (rogue simply because they feel like the melee version of a mage)","score":24},"68":{"subreddit":"AskHistorians","id":"15qcj2","comment_body":"&gt; Is there a particular image of or from your period that you find particularly important or potent? If so, why?\n\nI'll refrain from selecting one work in particular, but I'd like to talk about Masaccio's works. They are some of the most important pieces historically, in my opinion, because they were the first to represent the re-discovery of linear perspective. Possibly inspired by the mathematical theories of the architect Brunelleshi, Masaccio was the first painter since antiquity to accurately paint with linear and 3D perspective. Though we see artists trying to make [forms](http:\/\/www.virtualuffizi.com\/uffizi\/img\/445.jpg) appear 3D with [shading](http:\/\/upload.wikimedia.org\/wikipedia\/commons\/b\/bf\/14th-century_unknown_painters_-_The_Osnabr%C3%BCck_Altarpiece_%28detail%29_-_WGA23756.jpg) and other tricks, [this](http:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/9b\/The_Wilton_Diptych_%28Right%29.jpg) half-realistic and still mostly Gothic style remains until the end of the 14th century. Once Masaccio rolls into town with his works such as [Holy Trinity](http:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/d\/d2\/Masaccio,_trinit%C3%A0.jpg\/300px-Masaccio,_trinit%C3%A0.jpg) (1425) and [Madonna and Child](http:\/\/upload.wikimedia.org\/wikipedia\/en\/thumb\/b\/be\/Madonna_Masaccio.jpg\/300px-Madonna_Masaccio.jpg) (1426), things start changing fast in the art world. Word of this new perspective travels fast to other artists who begin to copy his style. It only takes another 70 or so years before artists are producing Renaissance masterpieces such as Raphael's [The School of Athens](http:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/94\/Sanzio_01.jpg). You can compare and see for yourselves how rapidly realism in painting was achieved once linear perspective was re-discovered. In summary: if artists in the middle ages hadn't re-discovered classical thought (including math and science), modern art might today be much flatter and less interesting. ;)","score_com":2,"title":"Monday Mish-Mash | Visual Art in\/and History","selftext":"Previously:\n\n- [Beverages and Drinking](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/14zrml\/monday_mishmash_beverages_and_drinking\/)\n\n- [The Treatment of the Dead](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/13gdvg\/monday_mishmash_the_treatment_of_the_dead\/)\n\n- [School and Education](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/13284v\/monday_mishmash_school_and_education\/)\n\n- [The Human Body](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/12o417\/monday_mishmash_the_human_body\/)\n\n- [Ships and Sea Travel](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/129x3e\/monday_mishmash_ships_and_sea_travel\/)\n\n- [Historic Firsts and Lasts](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/11wbeu\/monday_mishmash_historic_firsts\/)\n\n- [History on Film](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/11icba\/monday_mishmash_history_on_film\/)\n\n- [Historians](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/10rnl9\/monday_mishmash_historians\/)\n\n- [Naval Warfare](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/10e6wg\/monday_mishmash_naval_warfare\/)\n\n- [Fakes, Frauds and Hoaxes](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/1011jz\/monday_mishmash_fakes_frauds_and_hoaxes\/)\n\n- [Weaponry](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/zgiqx\/thursday_focus_weaponry\/)\n\n- [Historical Fiction](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/z2vaz\/thursday_focus_historical_fiction\/)\n\n- [World War II](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/yonze\/thursday_focus_world_war_ii\/)\n\n- [Crime and Criminals](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/yby8p\/thursday_focus_crimes_and_criminals\/)\n\n- [Animals, Beasts and Other Creatures](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/xxwhr\/thursday_focus_animals_beasts_and_other_creatures\/)\n\n- [The History of Music](http:\/\/www.reddit.com\/r\/AskHistorians\/comments\/xkn0h\/thursday_focus_the_history_of_music\/)\n\nAs has become usual, each Monday will see a new thread created in which users are encouraged to engage in general discussion under some reasonably broad heading.  Ask questions, share anecdotes, make provocative claims, seek clarification, tell jokes about it -- everything's on the table. While moderation will be conducted with a lighter hand in these threads, remember that you may still be challenged on your claims or asked to back them up!\n\nToday:\n\nFor today's general discussion, I thought we might consider the role of visual art both in history and as a conveyor *of* history.  Some general notes to start us off:\n\n- Famous paintings or photographs -- provide some examples, and examine why they've attained the reputation they have.\n- Noteworthy paintings or photographs of famous events (which is not necessarily the same thing as the above, though it could be) -- how do they depict those events?  What sort of concerns arise in examining that depiction?\n- The involvement of visual artists in the shaping of historical ideas and consciousness.\n- Artists who, in a more general sense, have had historically significant lives or careers.\n- Finally, though this is a bit of a synthesis of much of the above, I include it as its own bullet point to get the idea in people's heads: **Is there a particular image of or from your period that you find particularly important or potent?  If so, why?**","score":23},"69":{"subreddit":"somethingimade","id":"15q6au","comment_body":"What inspired you to make this?  Where will you display it?  Can we get a picture from the perspective of looking into the main entrance towards the statue?","score_com":1,"title":"Parthenon model","selftext":"","score":21},"70":{"subreddit":"somethingimade","id":"15q6au","comment_body":"What inspired you to make this?  Where will you display it?  Can we get a picture from the perspective of looking into the main entrance towards the statue?","score_com":1,"title":"Parthenon model","selftext":"","score":21},"71":{"subreddit":"BALLET","id":"14kqc5","comment_body":"That may be one of the most amazing things I've ever seen!! Ridiculous!! And beautiful and inspiring! Thanks for the link! ","score_com":2,"title":"Great Chinese State Circus- Swan Lake.. I know it's not technically ballet, but.. it's pretty amazing when she's en pointe one 1 LEG in arabesque, on his head AND turns. ","selftext":"","score":20},"72":{"subreddit":"NoFap","id":"15qt18","comment_body":"It could be the intense guitar solo I was rocking out to while reading, but this is one of the most well written and motivating things I've read in some time. It speaks to many facets of my life in a way that leaves me ashamed yet inspired. It's time to take life into my own hands. Thank you and best of luck in your pursuits. Let's leave this addiction that keeps us in a childish state and welcome a new productive life.","score_com":2,"title":"What if....","selftext":"What if I won the lottery...\nWhat if I got my dream job...\nWhat if I could ____...\n\n\"Meh.. that's just fairytale bullcrap that will NEVER happen to me. I'd probably find that I could effin' FLY before those other things happened...\"\n\nSTOP.\n\nWhen you ask yourself \"what if ____?\" and you write it off as stuff of \"fairytales\". You are choosing to believe something. I mean you never know. You MIGHT win the lottery, though the stats are not in your favor, it's still POSSIBLE. You want a know a way to never win the lottery? 100%? Never by a ticket. Yep, and never apply for that dream job.. and so forth..\n\nFor me, the fairytale that I've long chosen to not believe for myself is that some woman would ever love me. I've felt unwanted, unloved, unloveable, undesirable, unworthy by the opposite sex ever since I was 15. Funny how that's when I started PMO, isn't it? \n\nIt was a lie. \n\nA huge ball bustin', no girlfriend gettin', pity party throwin', self-emasculating, tantrum throwin' LIE!!! I've been treating PMO like Gollum's ring. \"Nobody wants me but the PRECIOUS LOVES US!\" Just like the Ring betrayed it's bearers, my fellow fapstronauts, you mighty soldiers, you destroyers of shame, you studs that you ARE, you will be betrayed by PMO. Don't you already feel it? I sure as hell do. \n\nWhen we go back to PMO, we put the Ring back on and throw away everything that's good about ourselves and we're CHOOSING to believe a lie...that the possibility of some girl EVER returning our feelings and want physical intimacy (not that CHEAP FAKE PORN SHIT... I'm talking about the real thing that some of us have never had or haven't had for years) is so far away, it might as well BE a fairytale.\n\nWELL OF COURSE IF YOU BELIEVE A LIE IT WILL BECOME TRUE FOR YOU! Tell yourself enough times you're unloveable and you'll believe it. You'll start living as though you are undesirable. You'll believe that the closest you'll get to living that fairytale is by reading OTHER PEOPLE'S story (and watching porn). Then you try and participate in that story by MO'ing. Weeaaaaak. And then the shame and guilt hits you. KA-SCARAM!!!! Yup. Reality sucks. You just woke up from trying to participate in someone else's 2-D story and found yourself unfulfilled, farther away than you've ever felt from a real woman's embrace. \"See??! I knew I was no good. What girl would want ME. I've got my pants around my ankles and I'm wiping off my pee-pee that was barely halfway erect.\" Send a nice little thank you letter to your reward center in your brain because you just put on the ring.\n\nBack to the fairytale. You want to know a good way to keep your dreams from EVER coming true? \nPut the ring on and go back to PMO.\nNever ask a girl out.\nConsole yourself in your shame and misery with more PMO.\nDon't invest in yourself or others.\nLive vicariously through your fakebook reality.\nContinue watching your reality TV.\nPlay MORE video games.\nDon't EVER exercise.\n\nWhat if.... what if... WHAT IF you changed the context of \"What if...\" from the realm of fairytale things that will never happen to you and made it an INVITATION to yourself? What if I.. becomes Why don't I?\n\nWhy don't... I put the video games away for a month (nah. for a year)...? Why don't... I delete my fakebook account? Why don't... I do 50 pushups before going to bed so my arms would be too tired to death grip half of an erection? Why don't I stop drinking\/smoking cigs\/weed? Why don't I quit PMO for 90 days.. what would my life be like? Why don't I purposefully go on a walk when I know triggers usually hit? Why don't I start exercising three days a week? What if I did all these things.. what kind of man would I become.  Level +10. Swag +100. Charm +100. Discipline +200. Irresistibility +500. Shame -100000. Guilt -100000. Chances that you'll ask someone out with level 99 confidence? Lucky 7777s, bitches!\n\nWhy don't you ask her out? Let me tell you a way she'll never go out with you, 100% guaranteed; if you never ask her and give HER the choice. If you make up her mind for her by not even giving her the option, you've sealed your fate. And a sure way you'll never ever ask her is if you put it off with PMO, and flog yourself with shame and guilt, solidifying in your mind that this is all you'll ever be and who would want that?  Good question.\n\nThe choice is yours. A brand new year starts tomorrow. \nWhat if 2013 was different?\nWhy don't you do something about it?\n","score":16},"73":{"subreddit":"NoFap","id":"15qt18","comment_body":"It could be the intense guitar solo I was rocking out to while reading, but this is one of the most well written and motivating things I've read in some time. It speaks to many facets of my life in a way that leaves me ashamed yet inspired. It's time to take life into my own hands. Thank you and best of luck in your pursuits. Let's leave this addiction that keeps us in a childish state and welcome a new productive life.","score_com":2,"title":"What if....","selftext":"What if I won the lottery...\nWhat if I got my dream job...\nWhat if I could ____...\n\n\"Meh.. that's just fairytale bullcrap that will NEVER happen to me. I'd probably find that I could effin' FLY before those other things happened...\"\n\nSTOP.\n\nWhen you ask yourself \"what if ____?\" and you write it off as stuff of \"fairytales\". You are choosing to believe something. I mean you never know. You MIGHT win the lottery, though the stats are not in your favor, it's still POSSIBLE. You want a know a way to never win the lottery? 100%? Never by a ticket. Yep, and never apply for that dream job.. and so forth..\n\nFor me, the fairytale that I've long chosen to not believe for myself is that some woman would ever love me. I've felt unwanted, unloved, unloveable, undesirable, unworthy by the opposite sex ever since I was 15. Funny how that's when I started PMO, isn't it? \n\nIt was a lie. \n\nA huge ball bustin', no girlfriend gettin', pity party throwin', self-emasculating, tantrum throwin' LIE!!! I've been treating PMO like Gollum's ring. \"Nobody wants me but the PRECIOUS LOVES US!\" Just like the Ring betrayed it's bearers, my fellow fapstronauts, you mighty soldiers, you destroyers of shame, you studs that you ARE, you will be betrayed by PMO. Don't you already feel it? I sure as hell do. \n\nWhen we go back to PMO, we put the Ring back on and throw away everything that's good about ourselves and we're CHOOSING to believe a lie...that the possibility of some girl EVER returning our feelings and want physical intimacy (not that CHEAP FAKE PORN SHIT... I'm talking about the real thing that some of us have never had or haven't had for years) is so far away, it might as well BE a fairytale.\n\nWELL OF COURSE IF YOU BELIEVE A LIE IT WILL BECOME TRUE FOR YOU! Tell yourself enough times you're unloveable and you'll believe it. You'll start living as though you are undesirable. You'll believe that the closest you'll get to living that fairytale is by reading OTHER PEOPLE'S story (and watching porn). Then you try and participate in that story by MO'ing. Weeaaaaak. And then the shame and guilt hits you. KA-SCARAM!!!! Yup. Reality sucks. You just woke up from trying to participate in someone else's 2-D story and found yourself unfulfilled, farther away than you've ever felt from a real woman's embrace. \"See??! I knew I was no good. What girl would want ME. I've got my pants around my ankles and I'm wiping off my pee-pee that was barely halfway erect.\" Send a nice little thank you letter to your reward center in your brain because you just put on the ring.\n\nBack to the fairytale. You want to know a good way to keep your dreams from EVER coming true? \nPut the ring on and go back to PMO.\nNever ask a girl out.\nConsole yourself in your shame and misery with more PMO.\nDon't invest in yourself or others.\nLive vicariously through your fakebook reality.\nContinue watching your reality TV.\nPlay MORE video games.\nDon't EVER exercise.\n\nWhat if.... what if... WHAT IF you changed the context of \"What if...\" from the realm of fairytale things that will never happen to you and made it an INVITATION to yourself? What if I.. becomes Why don't I?\n\nWhy don't... I put the video games away for a month (nah. for a year)...? Why don't... I delete my fakebook account? Why don't... I do 50 pushups before going to bed so my arms would be too tired to death grip half of an erection? Why don't I stop drinking\/smoking cigs\/weed? Why don't I quit PMO for 90 days.. what would my life be like? Why don't I purposefully go on a walk when I know triggers usually hit? Why don't I start exercising three days a week? What if I did all these things.. what kind of man would I become.  Level +10. Swag +100. Charm +100. Discipline +200. Irresistibility +500. Shame -100000. Guilt -100000. Chances that you'll ask someone out with level 99 confidence? Lucky 7777s, bitches!\n\nWhy don't you ask her out? Let me tell you a way she'll never go out with you, 100% guaranteed; if you never ask her and give HER the choice. If you make up her mind for her by not even giving her the option, you've sealed your fate. And a sure way you'll never ever ask her is if you put it off with PMO, and flog yourself with shame and guilt, solidifying in your mind that this is all you'll ever be and who would want that?  Good question.\n\nThe choice is yours. A brand new year starts tomorrow. \nWhat if 2013 was different?\nWhy don't you do something about it?\n","score":16},"74":{"subreddit":"crafts","id":"xy5h4","comment_body":"Super impressed! You have inspired me.","score_com":1,"title":"Homemade stuffed animals","selftext":"This is my first post so i hope this works...\n\n7 years ago, my wife was pregnant with our first child and i decided that i wanted to make some homemade toys for our yet-to-be born daughter. \n\nOne of the projects i started was to make stuffed animals. Below are 3 of the first ones i made - these are all hand sewn. I didn't use any templates at all - i just sketched out what i wanted them to look like, cut the fabric, stuffed and sewed. Each one of these took between 10-20 hours. (i know it is painfully slow, but i had never sewn anything before and i was usually watching a baseball game while i was making them)  :)\n\nHere they are\n\nhttp:\/\/imgur.com\/a\/uxyto","score":15},"75":{"subreddit":"AnimalCrossing","id":"15ga37","comment_body":"I think it looks cool with the lettering like that, it makes it feel more like a starter shop sign! I hope to see more animal crossing inspired paintings!  :)","score_com":1,"title":"Nook's Cranny inspired art.","selftext":"","score":15},"76":{"subreddit":"thesimscontests","id":"15h5f4","comment_body":"[Japanese-inspired Garden](http:\/\/imgur.com\/a\/oLAdk#0)\n\nGraphics seem to be kind of low but yeah =) \nDid this with a Japanese theme in mind.\n\nAdded some tropical aspects to it and some other items and voila!\n\nThis was pretty fun to do =)","score_com":3,"title":"Decorating Challenge #4!","selftext":"","score":14},"77":{"subreddit":"feedthebeast","id":"15q8o9","comment_body":"While everyone else on my server learned IC2, I was busy learning Mystcraft. I designed our servers teleport room, and will soon make my new base, with design ideas inspired by Doctor Who, and other scifi type things.","score_com":2,"title":"How do you feed *your* beast?","selftext":"With a modpack as robust and diverse as FTB, there are so many directions you can go in, it can sometimes be a bit intimidating to decide what to do first\/next. I figured I would ask the community what they do. Hopefully this thread can inspire a person or two who was getting bored, and thought they were \"done\" with the modpack.\n\n\nPersonally, at the moment I have two \"beasts\" I am feeding, the first \"beast\" is figuring out computercraft, and how to control my entire base from one central computer. The second \"beast\" is Thaumcraft 3. Learning it, crafting the golems, manipulating Vis, and getting shocked by wisps, lol. Everything I do in the game is for the benefit of those two \"beasts\", they are my end goal.\n\nBut that is just me, and this post isn't about me, it's about *you*, so I will restate the question I posed in the title:  \n\nHow do you feed *your* beast?","score":13},"78":{"subreddit":"TheLastAirbender","id":"15qutw","comment_body":"Bending should remain as it is, what would really benefit from a \"maturity boost\" are sword fights. In their current form, sword fights have predictable endings (no one will get touched by the blades) and the sword fighters have ridiculously impractical fighting strategies. Remember that one scene in the finale where Sokka and Toph were stuck between two fire benders standing on metal platforms? Sokka throws his boomerang at the left one, knocking him off the platform to make a badass takedown. For the second one Sokka grabs his sword and throws it at the metal platform under the fire bender. Instead of being awe-inspiring, I couldn't help but laugh a little and ask myself, \"why didn't he just throw it at the guy?\" Another instance of impractical fighting is Sokka (again) on the Day of Black Sun, where he hijacks a rhino-thingy by cutting the rider's spear right through the middle and then knocking him off. ","score_com":1,"title":"I think it would be interesting to see a more intense version of A:TLA","selftext":"Think about all of the things benders can do that aren't in the shows.\n\n* Water benders can dry a person out.\n* Air benders can suck the air out of your lungs.\n* Earth benders can remove minerals from your body (iron).\n* Fire benders can literally make your blood boil.\n\nI know it's a kid's show which limits the amount and type of violence\/warfare they can show, but there are such limitless possibilities as to what benders can actually do!  I absolutely love A:TLA, and is probably one of my favorite series ever - it would have been so much more intense if they had some more creative ways to use bending abilities.  \n\nAnyone else think the same?","score":13},"79":{"subreddit":"MTB","id":"15qz1y","comment_body":"I have a friend who makes some of his own components.  My concerns are what material somebody is using.  Most stuff coming out of professional bike houses are 7000 series T6 hardened aluminum.  That stuff is stiff and durable.  6000 series not so much, and anything else I'd be scared to run on my bike.  Cheap garbage metal is not confidence inspiring unless it's a non-essential part.  Chainrings, stem, seatpost interfaces, fork crowns...no thanks unless it's the good stuff.","score_com":1,"title":"Anybody custom fabricate their own parts?","selftext":"I am getting bigger into biking (road and mountain) and being a mechanical engineer am always thinking of different designs for parts\/accessories of my own. Built a few items like billet clamps, mounting hardware, chain rings, and bash rings. \n\nAnyone here care to post or share their own designs\/custom parts\/solutions they have come up with?","score":12},"80":{"subreddit":"exmormon","id":"15q89j","comment_body":"the other day I was on a rant, annoyed at how the church controls so many of the people in my life, annoyed that my friends would hate me if they knew who I really am, and just pissed off that my family Christmas was a bust. I was laying on the floor ranting about the church and my husband says \"I think you're not just anti-religion, you sound anti-mormon.\" Though that's not how I feel - I don't hate the church because it is the church, but I hate the way it influences my life. So... yes. I've been known to say mean things, though they were inspired by my real pains, and not just an arbitrary hatred of the church.","score_com":2,"title":"Have you ever caught yourself saying legitimately offensive\/hurtful things about Mormons?","selftext":"A few weeks ago I was out at Crown Burger with some friends and me and another male friend began talking about Mormons. I said something along the lines of \"Mormon girls are completely undatable. Once I find out a girl is Mormon, her attractiveness disappears.\" \n\nI had recently gone through a sudden breakup where religion was a factor and so I was feeling somewhat bitter in general, especially towards religion and relationships.\n\nAnyway, there were two of my LDS (female) friends sitting at the table. After what I said went through my mind again a few hours later, I realized how terrible it sounded. I apologized to them and clarified that I said what I did out of spite, not because it was actually true. \n\nTL;DR implied all Mormon girls are ugly, apologized. What shenanigans are y'all up to?","score":12},"81":{"subreddit":"Fantasy_Bookclub","id":"15qwl9","comment_body":"The Magicians by Lev Grossman\n\nI find it is a very polarizing book. It doesnt have conventionally likable characters or an uplifting message, which doesnt set well with some people. Its a great book for discussion. Also, magic boarding school! Always a great concept.","score_com":9,"title":"Vote for January's official book of the month.","selftext":"Nominate a book and give a brief reason why you think it would be a good choice for the book club. The book with the most upvotes will be the official book of the month for us to read and discuss.\n\nVoting will end on the 5th.","score":11},"82":{"subreddit":"asktransgender","id":"15pa92","comment_body":"Felt like something was wrong 5 1\/2 y\/o, looked into what an SRS was 10 y\/o (did not understand it), crossdressing wasn't enough &amp; went out as female 16 y\/o (sporadically &amp; did not last out of fear, went into the closet...literally sometimes), but it wasn't until I was around 24 y\/o when I became friends with a few trans girls that I actually considered transitioning. It was when my really good friend was scared &amp; getting her orchi that I kinda broke down, I was proud of her &amp; it was a bit inspiring for me. I dunno if that's too long of an answer but I'm 26 now, so either all my life or 2 years....whatever.","score_com":3,"title":"How long have you guys known youre trans?","selftext":"I know that for me, I never even considered life as a girl to be an actual option until this year. The idea of a sex change seemed extremely far fetched and almost science fictiony. I never used to cry to myself because I was a boy or even question whether or not I was a boy. What about you guys? how long have you known youre trans?","score":11},"83":{"subreddit":"socialism","id":"15qu0d","comment_body":"When the [Chinese] bureaucracy has finally succeeded in doing away with the vestiges of bourgeois property that hampered its rule over the economy, and in developing this economy for its own purposes, and in being recognized as a member of the club of great powers, it wants to enjoy its world in peace and to disencumber itself from the arbitrariness to which it is still subjected. It thus denounces the [Maoism] at its origin. But this denunciation remains [Maoist] — arbitrary, unexplained, and subject to continual modification — because **the ideological lie at its origin can never be revealed. The bureaucracy cannot liberalize itself either culturally or politically because its existence as a class depends on its ideological monopoly, which, for all its cumbersomeness, is its sole title to power**. This ideology has lost the passion of its original expression, but its passionless routinization still has the repressive function of controlling all thought and prohibiting any competition whatsoever. **The bureaucracy is thus helplessly tied to an ideology that is no longer believed by anyone**. The power that used to inspire terror now inspires ridicule, but this ridiculed power still defends itself with the threat of resorting to the terrorizing force it would like to be rid of. Thus, at the very time when the bureaucracy hopes to demonstrate its superiority on the terrain of capitalism it reveals itself to be a poor cousin of capitalism. Just as its actual history contradicts its façade of legality and its crudely maintained ignorance contradicts its scientific pretensions, so its attempt to vie with the bourgeoisie in the production of commodity abundance is stymied by the fact that such abundance contains its own implicit ideology, and is generally accompanied by the freedom to choose from an unlimited range of spectacular pseudoalternatives — a pseudofreedom that remains incompatible with the bureaucracy’s ideology.\n\n[Guy Debord, *Society of the Spectacle*, Thesis 110](http:\/\/theanarchistlibrary.org\/library\/guy-debord-the-society-of-the-spectacle#toc115)","score_com":0,"title":"Why does China even bother calling itself communist anymore?","selftext":"It's just state capitalism. I mean, how is communism even tought  in China without it being just some facade?","score":10},"84":{"subreddit":"hinduism","id":"15qlol","comment_body":"Oh, and these, because they remind me of some great people and they inspire me.\n\n\"One who is not envious but is a kind friend to all living entities, who does not think himself a proprietor and is free from false ego, who is equal in both happiness and distress, who is tolerant, always satisfied, self-controlled, and engaged in devotional service with determination, his mind and intelligence fixed on me - such a devotee of Mine is very dear to me.\" 12.13-14\n\n\"He for whom no one is put into difficulty and who is not disturbed by anyone, who is equipoised in happiness and distress, fear and anxiety, is very dear to Me.\" 12.15\n\n\"One who is equal to both friends and enemies, who is equipoised in honor and dishonor, heat and cold, happiness and distress, fame and infamy, who is always free from contaminating association, who is always silent and satisfied with anything, who doesn't care for any residence, who is fixed in knowledge and engaged in devotional service - such a person is very dear to Me.\" 12.18-19","score_com":3,"title":"On of my favorite quotes from the gita, what are yours?","selftext":"Thus spoke the Blessed Lord: \"In My opinion, the most perfect in yoga are those who invest their minds in Me and worship Me with supreme faith, being in constant communion with Me.\"","score":10},"85":{"subreddit":"blackladies","id":"15kf95","comment_body":"Just discovered [HeyFranHey](http:\/\/heyfranhey.com\/)- she's all about the natural hair\/beauty\/clean foods lifestyle, and it's fantastic.\n\nI was reading [Karla's Closet](http:\/\/www.karlascloset.com\/) from the very beginning, and her style has stayed pretty consistently fashion-forward and inspiring.\n\nI love [A Pair &amp; A Spare](http:\/\/apair-andaspare.blogspot.com\/)- I'm very much into DIY fashion, and her \"DIY on the runway\" posts are like the sparks of creative inspiration I need to craft new things.\n\nAlso, [Crunk Feminist Collective](http:\/\/crunkfeministcollective.wordpress.com\/)- along the same vein as Racialicious in its brilliance, intersecting feminist issues with race and gender. Their posts on the SlutWalks were fantastic.","score_com":2,"title":"What are your favorite blogs\/tumblrs? \n","selftext":"What are your favorite natural hair, life, fashion, cultural, food educational blogs?","score":9},"86":{"subreddit":"energy_work","id":"15k2il","comment_body":"I figured I wouldn't have much to contribute to the discussion, but I guess I can give it a shot, I've got at least one cool story.\n\n1) My deliberate \"practice\" in energy work is quite limited. I've only started exploring and reading about this area for about 6 months now. However, I learned that visualizing can be extremely powerful in energy working, and have always been extremely adept at being able to visualize things and processes, and thus I realized how potent I could be with applying it to energy.\n\nThe areas that I'm interested in the most and would love to practice are telekinesis and healing. I also want to be able to read other people's energy aura and study how different things affect it, like mood ad environmental stimuli. I guess these are also the areas I could use the most improvement in since I haven't been able to do much at all with them! (More on why I haven't been able to below).\n\n2) I got involved in energy work through a natural process of connecting interests, curiosity and slight nagging at the idea that something like energy work existed; I just didn't have a name for it yet. I started by becoming interested in some aspects of the occult, but was disappointed that I couldn't find any groups that existed on sites that I already used. I then found the occult subreddit and then \/r\/energy_work and was delighted. \n\nAs I touched upon above, I think since a young age I've known 'something' was out there that was energy work, I just couldn't really put a definition and such to it. Since I got interested in energy work I've been more aware of myself and how I have subconsciously 'practicing' energy work for quite a bit longer than I was interested in it. Little things I would do in life suddenly made sense. I'm still a little unsure about some things to do with this, but a while back I started intuitively trying to pull energy in from around me, not necessarily from any source but I kept doing it. If I did this enough I would get a tingling feeling in the middle of my forehead and a large uplifting sensation in the middle of my chest. Still not too sure what that could be doing, any commentary would be nice.\n\nThe most significant experience I've had with energy work came several months ago. For context, I have a fairly large dog that is deathly afraid of thunderstorms. Every time there is one, he gets visibly upset, extremely timid and whines a bunch. He will usually try to hide somewhere he deems safe, like under a table or in a closet. I feel bad for him, but one day I'm trying to calm him down and then instinctively put my hand on his head. I visualized his fear as tiny dark parts of his mind scattered all over, and my hand was a magnet of sorts to it. I 'pulled' the bits from him and gathered them in my hand and then blasted them away from me in fear that they could affect him again if I just left them laying about. After I was done I felt pretty silly, confused to why I even started in the first place. However, the immediate effects took me by surprise. He became instantly calm and active, not being afraid anymore. He then kept trying to lick my hands and show affection when I went about my business afterwards like he knew I did something to help him and was appreciative. I think that has definitely been my most memorable experience thus far, especially since it came without any practice or much knowledge of the subject. Reading through this I feel quite silly again for posting, but I figure if there is a good time and place to discuss it, it would be here.\n\n3) In terms of texts, I can't really recommend any. If I find any I'll be sure to let you guys know!\n\nNow the reason I can't practice much at all. I live on campus at my school with a bunch of friends in my apartment, and everyone has someone they share the room with (yeah I'm aware that it sucks, but not much I can do about it haha). My suite has some degree of noise going on at all times so I can't meditate without being distracted, and for telekinesis specifically I would like to start with a psi wheel, but would have a hard time explaining why I'm staring at this paper wheel all day. In short, my roommates would not be very receptive to this sort of stuff, so I try not to talk about anything related to this much. I recently found some quiet spots in my school that I could use in peace, so hopefully that will be enough to get me started.\n\nWhew, that was quite the post, but I gave as much as I could think of so I hope it was somewhat interesting.","score_com":5,"title":"Community Discussion - Your own experiences and talents","selftext":"Hey everyone,\n\nI am trying to get more into working with energy and am looking for advice for the beginner and tips or tricks.\n\nWe all know the area of energy work has multiple applications and can be done in several different ways (from telekinsesis to healing to name a few). I would like to know how each of you is using energy and how you got your start. This is a place to help shed some light on some interesting things you guys are up to (if you are willing to share) with the goal of exposing people to new areas and ideas.\n\nSo, a few starting questions that I feel would be appropriate:\n\n1) What area(s) do you focus most on in your workings? What are you best at? Area that you feel could use the most improvement?\n\n2) How did you come to be involved in energy work? Have you always been in touch with energy?\n\n3) If you could recommend texts on your favorite area of work, what would those be?\n\nThis isn't meant to be a rigid Q\/A, so anything additional you want to discuss is encouraged. If you guys have any suggestions for more questions I can edit them in. Looking forward to it.\n\n~Serzi","score":9},"87":{"subreddit":"rpg","id":"15pead","comment_body":"[BBC](http:\/\/news.bbc.co.uk\/local\/cambridgeshire\/hi\/people_and_places\/history\/newsid_8998000\/8998465.stm) has a article about witch hunts in 1640.\nA person you may want to read up on is [Matthew Hopkins](http:\/\/en.wikipedia.org\/wiki\/Matthew_Hopkins).\n\nI have a Dutch Revolt campaign going currently using Renaissance D100. I found a wikipedia article on the [Roermond witch trial](http:\/\/en.wikipedia.org\/wiki\/Roermond_witch_trial) of 1614 which inspired a adventure for my group. ","score_com":2,"title":"Sources for 17th Century Witch Hunter game?","selftext":"Howdy,  I'm thinking of running a game using the free Renaissance D100 rules and set in 17th Century Europe.  A dark game where the players will be witch hunters working for the Crown (or maybe the Pope?).  I want a bit of Solomon Kane feel and am planning on having some Call of Cthulhu stuff in the mix also. \n\nAny body got any suggestions for good books or other source materials to give me more of a feel for the era?","score":9},"88":{"subreddit":"tattoos","id":"15qg9s","comment_body":"A shop in my hometown will not do any non-Christian religious pieces, nor any nudity, or demon\/devil type artwork. When I first wanted an ancient Egyptian-inspired piece, the owner told me they would not do \"false gods\", and I was free to take my business elsewhere. [So I did, happily.](http:\/\/imgur.com\/2N0Qf) It just struck me as odd since marking your body is generally against most Christian doctrines.\n\nTheir piercer was badass though. Completely professional, no bullshit straight-talker. If I was still into piercings, he'd be my go-to guy. He even did genital piercings, which again, didn't seem to fit the general preachyness of the shop owners. ","score_com":15,"title":"Artists: What won't you do?","selftext":"I thought about this when I was in my small home town.  I saw one of the newer tattoo artists, who had just started at the only tattoo parlor in the \"city\".  He had a Star of David on his neck.  A couple of hours later, happenstance found a guy coming in (I was working at a gas station, so these were two separate customers) with a Southern Brotherhood tattoo (it looked too nice to be your typical prison scratching).  I thought \"I wonder what the first artist (assuming he had a fondness\/connection for Jewish history\/culture\/religion\/ethnicity, would say had that second guy come in and asked to get that tattoo?  So I'm just curious, artists (and I ask this as an attorney with some morals)... gotta pay the mortgage, but what won't you do?","score":9},"89":{"subreddit":"LifeRPG","id":"13jd1g","comment_body":"I made one on Edexel. I was inspired by my Maths teacher who used it to check our progress in the syllabus.\nThe problem is that I can't be asked to open up edexcel everyday. Perhaps a weekly check would be alright.\n**My point is it would be cool if there was a smartphone app for that.**","score_com":2,"title":"Is there a way to..?","selftext":"I was wondering if there is a way to have daily projects, small things such as go to college, get there on time, draw something, read something etc. it seems like something really useful, maybe if you had a task like \"go to college\" and then a drop down when you click it with the days of the week with tick boxes, you could also have another collum with a \"x\" out of \"a\" sub tasks complete.\n\n\n\nor maybe this could just be how sub tasks work :D\n","score":8},"90":{"subreddit":"Warhammer","id":"15pu6c","comment_body":"You've inspired me. I will paint my army as well.","score_com":1,"title":"Figured out a new year's resolution -- get everything painted.","selftext":"I have SO MUCH of my Deathwing-centric Dark Angels army unpainted or underpainted right now.  Plus basically all of my infantry-based Imperial Guard army -- half of that isn't even assembled yet!\n\nI think this is the year I'm going to get everything painted.  With the new DA codex likely to come out very soon (merciful Emperor of Mankind I hope) I'm actually getting excited about 6th Edition.  It might be nice to field an actual fully-painted army for a change!  I probably won't field everything at my usual top quality right away -- I'll just get them 'tabletop quality' and work on them individually as I get the urge.\n\n...now if I only had a clue about what lists I'd like to run.  It might be time to start playing some random games to see how they all shake out?","score":8},"91":{"subreddit":"homestuck","id":"15nzz3","comment_body":"I thought for sure someone would have mentioned [Prequel](http:\/\/www.prequeladventure.com\/2011\/03\/prequel-begin\/) by now.  \nI guess it's only tangentially related, but it definitely was inspired by Homestuck (and the forums) and uses a lot of the tropes.  \nIf you've played Oblivion or Skyrim, this will definitely be something you want to check out.","score_com":1,"title":"Recommend any Homestuck fan works or adventures?","selftext":"I'm relatively new to the fandom, having started reading homestuck a few weeks ago and already posted some content on this very subreddit. But I'm still kinda new and I'mm not really familiar to many fan works.\n\nI'm just wondering if anyone could recommend some really solid fan comics, fanfics, or maybe even a website where I could get a fix.","score":8},"92":{"subreddit":"Civcraft","id":"15qtci","comment_body":"I arrived in an airless and arid desert. I died from dehydration after my camel ran away from me. I saw a town in the distance, and I could see a sign hanging from one of the stores advertising a surgery and a pharmacy.\n\nI asked the proprietor if I could go adventuring with him and he told me that he was making a trip to Mt. Augusta, which I had already been planning to go to. I asked if I could come with him and he said it was at -5k -5k. \n\nI started off at a gentle jogging pace, I was pretty far away. I almost started to starve, but G-d sent me 3 zombies burning in front of me. I picked up the rotten meat and ate it, weeping at my degenerate bachelor lifestyle. Now I was no longer hungry, but I still wasn't sure if I would make it.\n\nThen [server] said server will restart in 10 minutes. Doc started running, he was at the bedrock level. I, got into a jungle, then a taiga biome. In the taiga biome, I started to starve again. I was just near a player-made dirt house so I died right there.\n\nI spawned near Tigerstaden, a lovely town.They told me the coords, I made it to Augusta and consumed some _Citrullus_ _lanatus_.\n\nSimide (You may know him), mister_magpie and another gentleman were on. They were complaining at length about lightning striking their domiciles. Mister_magpie was the owner of a hotel in which I rented a room. Well, I  didn't personally fork out the shillings to purchase it it, Simide paid 5w 4i for me. The iron was to go to the resistance. That evening over port and cigars, they invited me to join their group. After a little internal debate, I acquiesced. \n\nI inquired if I could go to the portal, mister_magpie gave the affirmative.  I got to the nether, and I was alone. Simide private messaged me, asking if I was okay.He also told me to be on the lookout as there was a risk of me being pearled.\n\nAs I said that, a new gentleman with the name of Fire something, said hello. I answered with the inspired words \n\n\"Hello, are you fighting for freedom?\"\n\nHe replied in the affirmative.\n\nThen yet another gentleman named RM something inquired if I was certain as to the location of my whereabouts.\nI replied that I was searching for a tunnel in order to make my way to Mount Augusta and meet my new friend Doc.\n\nOne of the men showed me the way as the sign was broken and I started to walk down the tunnel. Just as I was 100 blocks away from the portal a HCF member named joh something appeared. He tossed a loaf of artisan sourdough at me. The thick crust smashed into the side of my head, knocking my monocle askew.\n\nHe asked if I was from the resistance, I said yes as I believed the resistance were the side with the most moral justification for their actions. Organisations such as the LSIF, who fight for freedom. \n\nAfter this brief exchange, he pearled me because he was from HCF. This was my first time getting pearled. I private messaged the details of my predicament to Doc, and he asked for my \/ppl. It was at  -56 -29 in a chest either above or below the foaming sea.\n\nHe said I must msg someone like DMGamer. I did, and he asked for my \/ppl again. I revealed it and he said that he may release me.\nThen I ascended the wooden stairs to the land of nod and I remained imprisoned after my return to consciousness.\n\nI beg of you,  please, reveal unto me what is the resistance and who are the LSIF?","score_com":4,"title":"Can someone tell me what is the resistance and LSIF?","selftext":"no","score":5},"93":{"subreddit":"redditgetsdrawn","id":"15qjxc","comment_body":"Sorry to see that your post got downvoted...\n\nI just finished this: http:\/\/i.imgur.com\/Nk6nk.jpg\n\nI call it Eloquent Eyes\n\nNot exactly what you requested but this was the photo that inspired me :)","score_com":9,"title":"This is my modeling alter-ego, Talia Knight (A.K.A. Tali).. Anyone care to draw her?","selftext":"Tali has been around for about three years now..  It's hard for her to find work in the rural southern United States, but maybe one day she can make it in a big city.  Or maybe not.. I'm sure I'll be happy any way.. And hopefully I'll have a lovely drawing to add to my personal collection.\n\n***I'm sorry I don't have a picture for the icon.. Still learning about posting on Reddit (I lurked for months and finally decided to post).   \n\nLink to Album : http:\/\/imgur.com\/a\/6SV0p","score":4},"94":{"subreddit":"ABraThatFits","id":"15p9fn","comment_body":"I wonder which brands, too... some are quite stretchy in the band while others are not.\n\none thing to remember when looking for extreme push up bras, and something that drove me *bananas* once the classic wonderbra front closure push-up was discontinued and genericizing molded cups took over: when you're looking at \"extreme uplift\" or \"super boost\" or \"vavoom\" or whatever advertising language they're using, the size on the label is the size you will *look* with the bra on, not what size tits will actually fit in the damned thing!\n\nso when you're looking at, say VS's Bombshell line, the smallest cup in a 38 band is a C, but it won't fit a woman who actually wears 38C, but a woman who wears 38A. this might work for your friend. I have been frustrated by this so many times that I can't even tell you how glad I am to be able to tell a woman who might be able to make use of it!","score_com":2,"title":"38AA push-up styles?","selftext":"I have a friend who is searching for her first bra that fits (she is currently wearing a bikini top). She measures 36\" underbust, 37\" overbust. We recently tried on some 36As in several different brands, but the band was actually too small on all of them. She'd prefer a push-up style, as she doesn't have much breast tissue and push-ups make it appear as though she has more (she's a transwoman and in the first stages of transitioning, so she may have more breast tissue in the future. Its hard to say at this point, as she just started HRT). Is there anywhere we could find decent padded bras in a 38AA to order and try? 36\" bands just are not working, she could not even make the ends meet, despite her underbust measurement. Thanks for any advice anyone has!","score":4},"95":{"subreddit":"ukpolitics","id":"15q3dg","comment_body":"This is potentially the biggest and most catastrophic idiot trap of all time, and the fact people are discussing this as a desirable scenario does not inspire me with optimism for the future.","score_com":5,"title":"Move to make UK 'second class' EU state | \t\tStorytracker  | PoliticsHome","selftext":"","score":4},"96":{"subreddit":"rapecounseling","id":"15nu0h","comment_body":"I got a similar message from the person who assaulted me about 3 months afterwards--he was my boyfriend at the time of the incident too. While I would like to think that he has really changed for the better, it really infuriates me to think that it came down to raping the person who he loved to inspire improvement. I guess I am not out of the angry stage of recovery yet. \n\nMy incident was very similar to yours too--I gave up and let it happen. Perhaps the biggest difference was that I told him it was nonconsensual the morning after and spent the next day with him in complete denial that it happened. Leaving him was the most difficult thing to explain to him because I hadn't freaked out afterwards.\n\nKnowing that someone who loves you could do such an awful thing to you is really hard to swallow and rocks your trust in people who are close to you. I'm sorry it happened to you too. I unfortunately can't say I believe the \"I'm changed and improving!\" message from my ex-boyfriend...there is just too much shit to wade through.\n\nAnd, like you, it eats me alive knowing that my ex can walk around without the weight of this. Speaking out about it or reporting it would really f*ck his world up...but despite my anger about everything, I don't think I am ready to accept the label that I've been given publicly yet.\n\nBest of luck with everything--it's not your fault.","score_com":2,"title":"Date\/Acquaintance Rape.... Am I right in calling it that, was it possibly my fault, and has time made him realize what he did was wrong?","selftext":"*\"I don't think I ever did this. But I've changed a lot since we dated. And I apologize, and regret, about 90% of the things I did. Know you did nothing wrong. I wasn't found yet. I wasn't mature yet. Still am not, but I'm closer. I'm still not completely where I want. But I apologize for all you put up with from me. I'll admit, I was a piece of shit. I'm getting better though. I genuinely hope you're doing better without me, as you so deserve.\"*\n\nThat was the message I received from my ex-boyfriend, about 7 months after we broke up. The day we broke up was the day he raped me. He was also overall just a piece of shit(just like he said), he treated me terribly, and was overall just a pretty controlling person. \n\nAt first, I thought that this message I received from him was sort of an invitation for forgiveness, but the more I read it, the more I think he knows what he did was genuinely messed up. \n\nI could see easily where on the day of my assault that nothing seemed wrong. He prodded, threatened, and cajoled until I finally stopped saying no, stopped fighting him, and pretty much stopped everything short of breathing, blinking, and crying. \n\nI never said yes, but I stopped saying no. It's here where I have a hard time believing that the rape (that *is* what it was, right?) was my fault, because *I* gave up. This is probably the number one reason I'm skeptical on calling him out on it, because I do genuinely believe that it was my fault. \n\nBut anyways, where I wanted to go with this was: do you think he really didn't know the severity of what he was doing? And that after consideration, he realized what exactly he'd done? He was still a shithead after we broke up, and to my knowledge is still a shithead now. \n\nHe's still underage, and I don't *think* I want to do any legal action, I just... I'm confused I guess. I see him every day, and it makes me sick that he walks around being praised for being a good student\/successful person overall. I can go into more detail about the specifics of my situation, and before anybody recommends it, I'm in counseling right now, I've told the school (multiple people there), but I'm still very **very** effected by the trauma that came from all of this.  \n\nThanks for reading! &lt;3\n\n**TL;DR:** I received a message 7 or 8 months after my rape\/assault, from the person that did this to me, but I didn't realize it until around September of this year (almost half a year since getting the message). Does he realize what he did? Am I right in calling this situation a rape? Was it my fault for not being more assertive? ","score":4},"97":{"subreddit":"Hardcore","id":"15q775","comment_body":"Atlanta is doing cool things right now. Especially if you want jams inspired by 90s hardcore. Foundation is rad and deathbed has an awesome 90s sound.","score_com":2,"title":"Recommendations for an old mosher","selftext":"Hello all, \n\n30 something old mosher here who hasn't been to a show in forever. I'm looking for some recommendations, any new bands that would be worth listening to that may have come out in the last 5 years are so that I may have missed.\n\nRecently dug out my old vinyl collection and started reminiscing so thought I'd see what I've missed over the years.\n\nBack in the day I was a big fan of bands such as...\n\n* Champion\n\n* Blue Monday\n\n* Vision Of Disorder\n\n* Madball\n\n* Terror\n\n* The Promise\n\n* Throwdown (anything pre-Haymaker)\n\n* Indecision\n\n* Shockwave\n\n* Broken Oath\n\n* One King Down\n\n* Verse\n\n* Knuckledust\n\n* Ninebar\n\n* Most Precious Blood\n\nThings of that ilk really.\n\nAny suggestions would be appreciated! \n\n","score":4},"98":{"subreddit":"gaming","id":"15ppuv","comment_body":"A great article centered around Sanam! Give it a read!\n\nhttp:\/\/www.polygon.com\/2013\/1\/2\/3826854\/sanam-the-jordanian-platformer-inspired-by-rabbids-babylonia-and-the","score_com":1,"title":"Sanam, an awesome side scrolling game developed by 4 people!","selftext":"","score":3},"99":{"subreddit":"Meditation","id":"15qx3d","comment_body":"It's not uncommon to see lights. as stated below already there are different reasons this comes.\n\nIf it fits you, just enjoy whatever comes without defining it. And when it's gone, just let it go. It's helpful to overcome needless yearning for experiences, but there is nothing wrong with enjoying what life brings you.\n\nIn fact, maybe that is the real lesson. Enjoy what comes, don't miss it when it's gone, and appreciate what you have now and have had in the past.\n\nto answer your question directly, yes. I do see lights at times. sometimes they are very beautiful and inspiring.\n\nin yoga the source of all light is the light of God, or the light that comes through the spiritual eye. It's not something to turn your mind away from if you seek greater understanding or spiritual growth.","score_com":3,"title":"Does anybody here notice vision flashes behind your eyes while meditating?","selftext":"","score":3},"100":{"subreddit":"nuzlocke","id":"15p4k2","comment_body":"Trying my first ever run, and I do quite agree that it makes you value your pokemon a lot more. IT also is oddly creative as well, which inspired me to make a story as well about my character's journeys. I'm hoping to make my first post about it here in the next few days.","score_com":1,"title":"Why do you nuzlocke?","selftext":"Backstory: I just started my own nuzlocke (red classic rolling with felix the charmander) and lost already a few friends. \n\n\nThe road is long and hard, and it's just a game. Even if I DO WIN, make it to the hall of champs, what have I sacrificed in real life. The harsh mistress I return to after a save.\n\n\nHow long did you guys\/gals take to complete it, and why? Was it worth it?","score":3},"101":{"subreddit":"DebateReligion","id":"15qyqw","comment_body":"Let's assume the supernatural exists for a moment. Don't bother to argue it doesn't, just use your imagination for a moment.\n\nYou have one, don't you?\n\nWhy would you assume that those who died long ago would understand the afterlife completely? They didn't even understand their own lives. For all you know, the God of the Old Testament is Satan in pleasing shape. The serpent is subtle, after all, and the desire for revenge is one of the most basic of instincts. \n\nThen there's the New Testament, which brought us Hell to begin with. Did you know that Jesus went to Hell after he died? \n\nSome people swear he led the damned good out of the fires. \n\nThis much is true - eternal torture isn't an act of love, unless your definition of love is twisted poison...\n\nSo Christians have a choice. Accept that God is love and mercy, or continue to try to scare people into obedience. One is divine. The other, the legacy of an all too familiar hate, inspired by the quest for power.\n\nTo which will they give their loyalty? \n\nIt'll be fascinating to watch.\n\nEdit: to make my point clearer. If OP doesn't see this version of the post, I may resubmit. ","score_com":1,"title":"To Christians: why are you changing the definition of \"Hell\"? My thoughts inside.","selftext":"   I say this because I have seen it become quite a popular claim that the Christian \"Hell\" is not an eternal damnation, but rather either a transitory or non permanent area in which people are \"punished,\" but still may reach heaven. Let me remind you that Roman Catholics already believe in a \"Purgatory\" which serves this purpose, and Hell is simply the \"punishment\" area. \n      Source:  \"To die in mortal sin without repenting and accepting God's merciful love means remaining separated from him for ever by our own free choice. This state of definitive self-exclusion from communion with God and the blessed is called \"hell.\"- Pope John Paul II, in 1992, in \"The Catechism of the Catholic Church.\"\n\nI believe I know why this argument has surfaced, despite historical precedent; it is a way for Christians to hand-wave away the arguments about whether we actually have free will independent from God or not. \n\nIn the past, Hell was used as a way to scare the malleable minds of children into obeying their elders and their religion. It was also used as a way to justify a superiority complex about people who don't follow their own moral codes. Now, with the advent of increased communications and study of the human psyche, we see that people's actions and moral codes are more a result of the social context and moral code they are raised in, which raises a problem for Christians: why would God punish someone for simply obeying the norms and moral codes that they were raised in, while simultaneously rewarding others for following the Christian-centric moral codes of their civilization?\n\nTheir solution? To claim that God doesn't actually \"punish\" anyone, He merely corrects their viewpoints in Hell and then welcomes them into his arms. A feel-good explanation, to be sure, but one that is 100% not supported in Catholicism (source: my strict upbringing, the words of the Pope, and general historical teachings), and not one supported by most other denominations either, as far as I can tell.\n\nI would love to hear Christians' opinions on these thoughts, and I would also love to see any sources of these claims of a relatively \"nice\" Hell being supported historically. Thanks.","score":2},"102":{"subreddit":"askphilosophy","id":"15qfb4","comment_body":"I first understood the point of philosophy after I read Meditations on First Philosophy by Descartes. It inspired me to question things and start coming to my own conclusions about the world. Its a relatively short and easy read.","score_com":1,"title":"New to philosophy: where do I start?","selftext":"I am a person who has been interested in studying some sort of philosophy for a while now, but have never had the time to delve into such things in any depth or at all, really. I'm wondering what sort of books or internet stuff I should read as a sort of introduction regarding the discipline, or just something to start with that wouldn't be overly complex or convoluted. ","score":1},"103":{"subreddit":"Life","id":"15lts5","comment_body":"You just inspired me so much, I'm finally going to try and get off of reddit.","score_com":2,"title":"Fellow Redditors, how has someone turned their lives around for the better?","selftext":"I have a friend who was one of the funniest people I have ever met. We became friends during my social awkward finding of myself the freshman year of high school.We both ran cross country over the summer, had the same gym class, and even the same lunch. As I learned more and more about him over the years, I realized how different of a person he was. As I can recall, my good friend started shoplifting. It started with small items like DVDs. Not sure why he did it, but it soon became his drug. It seemed every weekend he would come into school fashioning high end clothing, watches, shoes- you name it, he had it (especially if it was in GQ). After having run ins with police multiple times and even faking mental illness, he had really become a pro in the field of theft. Finally, he slowed down and started to pay like a regular shopper again. Today, he is serving in the armed forces, loves his job, has a beautiful girlfriend, and still has a good friend in me that couldn't be any more proud of him.","score":1},"104":{"subreddit":"BreakUps","id":"15qk5k","comment_body":"Reddit lurker inspired to make my first ever comment...don't send it!  Just send \"Happy Birthday\"  Why?  insight into female psyche coming...too angst ridden and needy.  A simple \"happy birthday\" says \"I'm thinking about you, but not too much.\"  And it makes her wonder what you're up to.  Like you're too busy doing other fun things to type some long, lengthy text and not sitting around plucking daisies going \"she loves me, she loves me not.\"  Which makes you FAR more interesting, and therefore desirable.  Enigmatic...and busy--that's what you're going for.  Be a friend...casually.  If it's meant to be more it will happen.","score_com":2,"title":"What would you think if you received this text?","selftext":"**My ex and I had a \"summer fling\" the summer before we both left for different colleges, and made the mistake of trying to work things through the long distance when we left. We ended up breaking up due to complications with lack of communication\/effort on her part, trust, and I did things that made her stressed, and she did things that hurt me. I've moved on since then, I don't want a relationship in college right now, especially a long distance one, and I just want to enjoy life and find out who I am. Her and I have met twice since the break-up, and just talked like old friends and didn't discuss anything relevant to the break-up. She's started to express more interest in our friendship (as far as I can tell), wanting me to visit her at her college this semester, wishing me a Merry Christmas when she didn't have to, etc. It's her birthday in a few days, and while we've kept things very relaxed and lighthearted, I'm torn as to what to say. What would you think if you received the following text?**\n\n\"It would be easy (and maybe better) to just text you a simple happy birthday and leave it at that, but I thought that I should say more, given everything. I'm sorry that we ever tried to make things work through college, and for the rift that it created between us. All the exhaustion, frustration, resentment, and stress boils down to that. Even thinking about it now is exhausting in its ambivalence. I will not speak for you, but I know I handled and did things in a way that I regret, and have learned from. I think college so far has changed both of us, as it should. If you want to talk more about any of this in person, I'd be happy and open to, but at this point I'm tired of living in the past. Relax, lay back, and be easy, right? I do not, however, regret driving down your street last May, asking you to Prom, and getting to know you. The past times we've recently met have been good, and I'd like to hang out again before break ends. Here's to a new year, and a new semester. Happy Birthday _____.\"","score":1},"105":{"subreddit":"pics","id":"15qxg0","comment_body":"Age | User | Title | Reddit | Cmnt | Points\n:--|:--|:--|:--|:--|:--\n3 weeks | [NoStaticAtAll](\/user\/NoStaticAtAll) | [Hey, check out my girlfriend's new painting. She says it's not that great, but I think she has talent (please be supportive)!](http:\/\/www.reddit.com\/r\/pics\/comments\/14dfq8\/hey_check_out_my_girlfriends_new_painting_she\/) | here | 17 | 10\n1 year | [Crochetniac](\/user\/Crochetniac) | [Iamadoctor has inspired me to be truly original and share my work on reddit. Here's a painting my dad and I made when we were bored.](http:\/\/www.reddit.com\/r\/funny\/comments\/kcbuh\/iamadoctor_has_inspired_me_to_be_truly_original\/) | [\/r\/funny](\/r\/funny) | 51 | 282\n4 months | [bigmeetchlarryhoover](\/user\/bigmeetchlarryhoover) | [The McKayla Lisa](http:\/\/www.reddit.com\/r\/funny\/comments\/xyqw2\/the_mckayla_lisa\/) | [\/r\/funny](\/r\/funny) | 85 | 1112\n* See **88 more** matches at [KarmaDecay](http:\/\/karmadecay.com\/r\/pics\/comments\/15qxg0\/a_deep_drawing_from_an_8th_grader\/)\n\n*This is an automated response* \n\n[FAQ](http:\/\/www.reddit.com\/help\/faqs\/SimilarImageBot) | [Send Feedback](http:\/\/www.reddit.com\/message\/compose\/?to=SimilarImage&amp;subject=Feedback Id 15qxg0&amp;message=[Link to post](http:\/\/reddit.com\/comments\/15qxg0\/\\) 'I like feedback') | [Report Error](http:\/\/www.reddit.com\/message\/compose\/?to=SimilarImage&amp;subject=Error Id 15qxg0&amp;message=Have you read the FAQ? Please specify the error.[Link to post](http:\/\/reddit.com\/comments\/15qxg0\/\\) 'Help me grow')","score_com":1,"title":"A deep drawing from an 8th grader","selftext":"","score":0},"106":{"subreddit":"AskReddit","id":"15qwfn","comment_body":"I used to volunteer a lot with the special Olympics. I have to say, I have never seen happier or more supportive parents. Disabled people are usually some of the most inspiring, because they don't let their disability get the best of them.","score_com":1,"title":"Parents of disabled children, if you had the chance to go back in time and have an abortion, would you?","selftext":"","score":0},"107":{"subreddit":"truegaming","id":"15onta","comment_body":"People take things away from games on an individual basis depending on many factors such as upbringing, maturity, etc. A violent video game can have a positive effect on a player who would take his frustrations out on real people otherwise in the same way that the same game can provoke violent feelings in another player. Parents should be the judge in these situations. For me personally, I was able to play games like Halo in my early teens or possibly earlier because my parents felt I was ready. Other children may not be ready to play these games until much later. Unfortunately, some of these kids are not mature enough for games because of a lack of parental guidance or familial issues, and thus have little to no monitoring or control over what they play and when. Conversely, some kids may never have enough control and become inspired by games that give them the same freedom they experience at home. In short, I don't think that there is any one right answer as to the effects of video games. I think a lot of factors, primarily familial and social ones, play into what a player takes away from the gaming experience.","score_com":2,"title":"How do games affect us?","selftext":"The consensus on reddit seems to be that video games are not responsible for the violence we see in the media, and for the most part  I believe this is probably true. So how do they affect us? I don't believe that the kid sitting down to play CoD for the first or hundredth time takes no impressions away from it. Nor the thirty-something working adult playing Zelda through once more. The things we choose to include in our lives no doubt influence our perception of the world around us, and perhaps to an even greater extent at a younger age. \n\nWhat are the dichotomies of influence in gaming between genre, frequency, and age on our state of mind? On our cultural beliefs? On our personal an social expectations? \n\nI won't be letting my child anywhere near a CoD game if I can help it, if not for the senseless proliferation and glorification of war then for the caustic online community that inhabits it. Am I wrong to limit his or her experience when that time comes? \n\nThere's plenty of conjecture I could make about the effects of different genres and even specific games on our expectations and our consciousness, but I'd like to hear from the community at large to see what you think. And I certainly don't want to limit the discussion to violent games promoting aggression and the like, though this is completely valid too. \n\nCheers!","score":0},"108":{"subreddit":"childfree","id":"15qtp8","comment_body":"I believe the minority hasn't spoken up here. But I did comment on the post that inspired you to write this. All the people who enjoy the nonsense childfree produces has come to retort. But believe me, I'd love to be separated from it all. And I think you found others speaking up for such a thing in other posts. Its just the majority is a much louder, and more numbered so they will more likely be online and have something to say. We the minority may not speak up here, but weall have shown our interest in your idea in other threads. The thing is, there is already r\/truechildfreedom which you can subscribe to. If the minority were to subscribe it would be nice, but idk how much more media the sub would get. Its worth a shot tho. Im tired of hearing about bad parenting on a childfree forum.","score_com":-2,"title":"[Meta]Open Dialogue with the Mods","selftext":"Ok guys so here goes...\n\nAfter [this No. 1 post](http:\/\/www.reddit.com\/r\/childfree\/comments\/15q9sk\/is_this_subreddit_for_people_not_wanting_kids_or\/) and the ensuing discussion, I'd like to try and open a dialogue regarding the direction this subreddit is going and hopefully get a better feel for what the mods\/community want out of r\/childfree.\n\nWhen I first started coming here I found this place very insightful and it was very meaningful to me to have a place where liked minded folks shared so openly.  We've grown since then and with that growth comes an ever changing landscape.  \n\nWhat brought me here were thought provoking discussions like [\"How much has the possibility of having a child with a disability or mental illness factored into your decision ro be childfree\"](http:\/\/www.reddit.com\/r\/childfree\/comments\/15p30g\/how_much_has_the_possibility_of_having_a_child\/) and [\"Considering adopting the childfree lifestyle, but a common question plagues me\"](http:\/\/www.reddit.com\/r\/childfree\/comments\/15ql5g\/considering_adopting_the_childfree_lifestylee_but\/)\n\nHowever, recently (as is typical of a growing subreddit) we have seen more and more \"circlejerk\" type posts such as [\"Nightmare and 30,000 Feet\"](http:\/\/www.reddit.com\/r\/childfree\/comments\/15p8ej\/nightmare_at_30000_feet_xpost_from_rhistoryporn\/) and [\"I was waiting to get my haircut and got to witness this for 15 minutes\"](http:\/\/www.reddit.com\/r\/childfree\/comments\/15qgjl\/i_was_waiting_to_get_my_haircut_and_got_to\/)\n\nNow, I do not mean to speak for everyone, but the general consensus I took away from the comments in susurro's post (and the resulting PMs to my response) is that the latter wasn't particularly welcome and the former is very much missed and no one wants this place to become r\/atheism. \n\nI would propose you create an additional subreddit and separate the lifestyle discussions from the memes\/rants\/whathaveyou.  This allows the subscriber to pick what they like and will limit one preference to steam roll over the other (people always have the option to sub to both if they like the way CF is now).  Just some food for thought - Thanks for your time.\n\n****************************************************************\nEDIT:  Alright folks, I've never been the type too proud to admit I was wrong.  Given the comments and votes I clearly misinterpreted a vocal minority to be the majority.  Thanks to everyone who contributed to the discussion and have a happy New Year.","score":0},"109":{"subreddit":"diablo3","id":"15pyhl","comment_body":"Hey, 1.1k hours barb player here.\n\nThere are many things you can improve. Your skill setup especially.\n\nRight now, you have :\n\n- 2 AoE abilities\n- 0 single target damage\n- 0 escape\n- only 1 active damage skill at a time (either WW or cleave)\n- low\/risky (because CD) regen\n\nDo you really need WW ? If yes then why ?\n\n- To ignore unit collision ? Leap or Furious Charge can do that job AND provide you a much better escape (in case you get walled, vortexed into frozen, need to run away fast, etc.)\n- For AoE damage, as a fury spender ? Try Rend (ravage \/ bloodlust), it will give you high AoE damage (and even regen if you use bloodlust). On top of that, once you're done with the animation, you can use other skills for more damage. The more spells active at a time, the better.\n\nAre Maraudeur's Rage \/ lifesteal Ignore Pain that good ? Over Revenge - provocation  (AoE + heal) ? Over an escape tool ?\n\nIs cleave that good ? Why ?\n\n- AoE ? If you use rend and revenge, white trash will melt.\n- Single target damage ? Mistake then, because Frenzy is much better for that (bonus : maniac increases rend\/revenge damage, sidearm procs life on hit and provides a small boost to your AoE damage).\n\nNow, about your regen. You based it on lifesteal, which is not optimal imo when you're only at 40k damage. Lifesteal suffers a 80% nerf in inferno, which makes it pretty bad if you dont have really high damage. Get high life on hit and attack speed.\n\nOne last thing, have you considered getting a [Thunder God's Vigor](http:\/\/www.d3lexicon.com\/item\/thunder-gods-vigor) ? The melee reduction on that belt is pretty strong. You can get a cheap 18+% one for 100k (yes, in the HC ah). \n38k is pretty good i think. I cleared inferno 2 days ago with a bit less than 20k dps (then switched to ww). \n\nhttp:\/\/eu.battle.net\/d3\/en\/profile\/Ciriath-2833\/hero\/22019363\n\nPS : about your passives, you may want to use superstition and the other armor passive vs act III monsters. The succubus debuff only applies to your base armor, and do not remove 50% of your bonus armor. Therefore, you can +\/- counter it by stacking bonus armor passives.\n\nI cleared Inferno pretty easily using triple def passives (inspiring presence over tough as nails until act III succubus), and frenzy + rend + revenge. With 20k, i never felt like my damage was lacking.","score_com":1,"title":"Need suggestion on how to make my Barb60(13) better","selftext":"So im halfway thru inferno atm. \nIm doing okay I guess, sometimes I have a \"oh shit\" moment but rarely go bellow 25% hp. I feel that my dmg is really low, 38k unbuffed. I manage Act 2 without a hassle with this damage but would obviously like to raise it more. When I go exploring the Auction House I have a really hard time deciding if something really is worth it and then notice after buying that it will just lower all my stats even when it looked awesome in the AH.  My weapon isn't the best one but I have been unable to find anything quite like it with life steal and str vit in the amounts that it have. \n\nThanks for any input :) \n\nhttp:\/\/eu.battle.net\/d3\/en\/profile\/nugge-2703\/hero\/22238115","score":0},"110":{"subreddit":"GunsAreCool","id":"15qmm5","comment_body":"That was my post...and after getting slammed for the quality of the pictures and the fact that the guns were on the bed and not posed on a museum quality display taken by a $5000 professional DSLR, I deleted the post.  *Almost snapped*, but then remembered that I'm sane, have a good life, and generally like people.\n                     \nThe comments were not uplifting, and I certainly didn't stand tall with pride after reading them, but hell this is Reddit and no one should come here looking for compliments.  I just remembered what my grandma used to say, \"they pick one you because they're jealous\".  And she hated people.","score_com":2,"title":"If this redditor snaps... 11","selftext":"","score":0}}