{"3":{"subreddit":"AskReddit","id":"15qmfc","comment_body":"I can't find evidence that these ever existed but I totally remember my nan taking me to Wawa to get them: Wacky Willy Milkshake. It was a big yellow carton that had that extra thick chocolate milk they marketed as \"shake\" before Nesquik and Hershey bit the bandwagon on them. (around 1997-99)Also, these candy bar inspired granola bars, specifically remember one that included twix, pretzels, and some other snackies.","score_com":1,"title":"What is your favorite product that has been discontinued?","selftext":"Simple question. What product did you love that the rest of the world just didn't get on board with and was subsequently discontinued?We could be talking Crystal Pepsi to the Mcdonalds Hula Burger or anything in between?EDIT: First, wow.. this is long overdue.. Thanks to everyone, it's pretty amazing to see how much stuff has been \"missed\".. As my first (Semi-2nd) post ever this was an amazing turnout. I didn't realize until a friend of mine told me that I should edit this and let people know what has been said..Basically, everything has been said, if you aren't over 50 and remember things from before that time, it has likely been said.. THanks so much.. can you \"close\" off a post to responses without deleting it? Just curious","score":1750},"12":{"subreddit":"AskReddit","id":"15q5m5","comment_body":"[Clodia Metelli]( just to see what all the fuss was about. My username here was (likely) inspired by her.","score_com":1,"title":"If you could have sex with any historical figure, who would it be?","selftext":"It could be anybody, alive or dead.edit: context? (when, where, how, why, to what extent)","score":1351},"14":{"subreddit":"todayilearned","id":"15qnxt","comment_body":"I'm way more excited by the fact this may inspire someone to become Cagey.","score_com":2,"title":"TIL there is a New York graffiti artist that replicates Banksy artworks while adding Tom Hanks face to everything- Calling him\/herself \"Hanksy\"","selftext":"","score":900},"15":{"subreddit":"todayilearned","id":"15qnxt","comment_body":"I'm way more excited by the fact this may inspire someone to become Cagey.","score_com":2,"title":"TIL there is a New York graffiti artist that replicates Banksy artworks while adding Tom Hanks face to everything- Calling him\/herself \"Hanksy\"","selftext":"","score":900},"16":{"subreddit":"offmychest","id":"15qr3l","comment_body":"I'm also trying to get through school, and I'm also 22. You inspire me!","score_com":4,"title":"(860) 250-2386","selftext":"It's New Years Eve, i'm a 22 year old male trying to get through web design school. my moms a drug addict and takes pills from my grandmother while im recovering and trying to stay sober, my dad was severely disabled in a motorcycle accident, i didn't get a single gift for christmas from anyone, i have no money or booze, i've tried offing myself twice this year with sleeping pills, 3 nights ago my best friend found out i slept with his ex over the summer and won't talk to me, i havent eaten today because theres no food and i have no car or money, and i'm spending the night alone.send me a picture, love letter, prank, hate message. i dont care, it's better than nothing. cheers and happy new year.","score":845},"23":{"subreddit":"TwoXChromosomes","id":"15qxsy","comment_body":"It's already 2 hrs into the new year, but I figured I'd answer. I spent NYE at home with the parents, while my siblings went out. I'm on crutches after a recent ankle surgery, so I couldn't go anywhere. Like you, I'm home from college and don't have any friends in the area, so no home visits. It really can get lonely.Admittedly, I spent a lot of the night sulking in self-pity - not just about the fact that I'm a 21yo sitting at home on the biggest party night of the year, but also because this crutch situation will be with me for another 3 weeks, followed by 5-8 more months of a walking boot\/physical therapy. It sucks because I'm going into my final semester of college, and it's hard not to feel like my ankle surgery has ruined it for me. I felt a little better toward the end of the night, enough to cheer when the clock struck twelve, but I know I'm going to struggle a lot with this feeling of sadness over the next few months. At least I'll have my college friends to help me through the darker times. But I'll cross that bridge when I get to it.Sorry for being a downer; I just needed to vent a little. I'm so happy for you that you're going on to pursue your dream! It's very inspiring. Keep up the passion, and happy new year!","score_com":1,"title":"Anyone else spending NYE alone?","selftext":"I'm home from college and don't really have any friends in my hometown. I miss my college friends a lot and I'm going to spend the night with Netflix and beer. In spite of how lonely I feel this night, I'm looking forward to 2013. I have one more awesome semester, and then I'm moving to DC to enter a graduate program where I'll begin to pursue my dream of becoming a teacher :) What are you ladies doing tonight?","score":348},"24":{"subreddit":"Fitness","id":"15qraz","comment_body":"Kudos, you look amazing! Do you find that as you get older your body responds to excercise differently? As a female who did a lot of strength training in my 20s, I found even with supplements I didn't really start getting great definition until my 30s. Thank you for inspiring me to get back into my routine!","score_com":5,"title":"Pre-Geezer (M, 47) work in progress.","selftext":"Thanks for all the help Fitt.Happy New Years to all. [Male, 6’- 0, 47 years old, 167lbs](Diet - Vegetarian most of my adult life. Don't drink or smoke cigarettes. Weight - 148lbs August 2012 -&gt; 167lbs January 2012.Started with an empty bar doing Stronglifts, 3 times a week (57 lifting sessions) . Current Stats for 5x5 Bench 170Squat 230DeadLift 300OHP 130Weight lifting goals. Just squeaked into the 700 lb. club. Longer term goal is to join the 1000Lb Club before I turn 50.I did the SL routine. There is a Stronglifts app. ios) which was really helpful keeping me motivated and on track. Started working out in my local gym. Later, I Craigslisted some weightlifting equipment for a home-gym. Suits me better. I have started adding weighted dips and pull-ups and an ab wheel. My squats started to stall at 5x5 changed to 3x5. Feels good.","score":347},"35":{"subreddit":"NoFap","id":"15qqb6","comment_body":"Well done sir. You inspired me to dig out my old laptop and delete all the porn I had on it. That was the last one!","score_com":1,"title":"Just deleted about 190GB of porn from my laptop.","selftext":"I am switching back and forth between a huge feeling of relief and a large sense on loss.","score":126},"37":{"subreddit":"AMA","id":"14wmxm","comment_body":"This is an impressive thread. I saw [this comment]( where user wtf_shroom asked if you have considered formally teaching in the subject area at a college\/university. I think that people as wealthy as you with the gift of inspiring the imagination, and ability to encourage people to do their own research would be well fit to be a teacher. It is clear to me in this thread that your passion about this subject is a wonderfully strong force that I'd like to encourage.I saw at one point you mentioned in a matter-of-fact way that drug use was a part of your life. I'm curious as to what your thoughts are on the tendency of the human mind and maybe particularly the drug induced mind, to be apt to pattern recognition. Especially when it relates to mythologies and archetypes, it seems that this pattern recognition mechanism is in overdrive, seeking to mentally resolve the salient subject: the mythology or archetype in question. Given the depth of research you have done and the corpus of stories that float around in your mind, what is your perception on this pattern recognition mechanism of the mind as it relates to either your own decisions and beliefs regarding this subject -- or to us collectively? In addition how do you see the alteration of this mechanism as a result of drug use?After reading a good majority of the comments in this thread, I got to thinking how incredible it would be to have a timeline style global visualization of the general sequence of events and a visual representation of the spread of the world's stories and mythologies. Imagine Google Earth, including a geographically accurate early-Earth (to our best understanding) and data for the various communities and civilizations over time, including: mythologies, texts, cultures, nations, island-bridges, and locations. I have several philosophy of religions texts that have some basic timelines of the influence of religions, but one like this constrained on a map and regarding the subject of mythology would be amazing. Have you come across anything even remotely like this kind of timeline for this subject? I, along with several other people, was looking for reading recommendations to approach this massive subject. Here is your comment with the [reading recommendations]( for others -- Thanks for that!Thanks for making this thread it's been a great read and an inspiration for me to get back to one of my neglected passions. Hope you will consider your ability to influence our collective story.","score_com":1,"title":"For the past 18 years my hobby has been the study of ancient mythology and its links to modern theological beliefs. AMA","selftext":"I am *not* a professional and I can't think of any proof to give to mods other than the answers I provide to your questions. For nearly two decades now I've spent most of my spare time studying ancient mythology, my interest initially piqued by Sumerian culture but soon developing to encompass the myths of many subsequent races and cultures and then later to determining the bridging gaps between modern theology, modern belief systems\/religions and their origins in Babylonian myth. This is a big subject and my knowledge is, by no means, exhaustive but ask away and I'll do my best to answer your questions.Edit: Thanks for all your questions. I'll be away for some of today but I'll try to pop back in to answer new comments\/questions as and when I can.","score":123},"46":{"subreddit":"proper","id":"15qnz0","comment_body":"Indeed. It is far better to uplift others and risk failure than to scorn others and always succeed. You must provide encouragement, chaps, so that one day the world will voluntarily walk our path.","score_com":4,"title":"I wish to make a formal complaint.","selftext":"Dear Sir or Madam,I wish to make a formal complaint. During my recent perusal of \/r\/proper I was both shocked and alarmed by harsh comments made on a multitude posts-- a large number of which contained snide jokes concerning people’s economic status in society. In laymen’s terms, you have overused prejudiced and unfair terms like *peasant*. As we all know, one does not get to choose their place in our society. It is because of the entitlements granted to us as the elite that we often look down upon others, but we must not stoop to such base levels of belittlement. As gentlemen, and gentlewomen, we must rise above the rest and take a more couth means of approach. So next time you feel the urge to demean someone for their misuse of grammar, or their inability to understand what is or is not proper, I think a simple downvote should suffice.Respectfully yours,asthelionsleeps","score":64},"50":{"subreddit":"RandomActsOfGaming","id":"15qmcr","comment_body":"According to you I'm not qualified since I found out about reddit almost a month ago. BUT I will tell you about my favorite soccer team that I follow so faithfully. It was back in 2001 when I was watching a Premier League match... Liverpool - Aston Villa (1-3 just for the record), when I realized that I wanna support Aston Villa. I was so inspired with how our players played and managed to take the win even after been equalized 1-1 by Gerrard. Since then, I support The VILLANS, and I will support them till the end (Villa has given us - middle PL club fans - the joy of participating in Europa (and also winning a Champions League for older supporters)). The past and current year, we are struggling to avoid relegation. We avoided relegation last year, and I was so pleased (we are one of the five Premier League teams that have never been relegated). This year we are struggling again but I have faith in Lambert's plan and in our players that they can do it. Even after conceding 15 goals in 3 matches and scoring none, this team can do it!!! UP THE VILLANS! GET IN THERE AND SMASH THE ENEMIES WE ARE WITH YOU!(Thanks for the giveaway nevertheless and Happy New Year to everyone!)","score_com":1,"title":"[Giveaway] $15 steam game","selftext":"I'm feeling excited for the new year in anticipation of the champions league (I'm a huge BVB fan) and feel like doing something nice. I will be giving away 1 $15 (or under) steam game to first place and 1 $10 (or under) steam game to second place. To enter just tell me about your favorite soccer team or player and why you follow\/like them.Or if you don't follow the sport at all, just tell me a random story (preferably an interesting one) of something in your life. Also, your reddit account must be at least 3 months old and 100 comment karma as well as have a steam account so I can gift it to you.I will select the winners based solely on my discretion on what I find are the best submissions. I will read all submissions and don't worry, I won't give precedence to whether or not its about a soccer team or something from your life! I will message the winners asking what game they want.Hope everyone had a merry Christmas and has an awesome new year.I will choose the winners sometime tomorrow, most likely after work so like close to midnight tomorrow.","score":48},"52":{"subreddit":"GlobalOffensive","id":"15qq02","comment_body":"No one will be able to share my nostalgia, but I loved playing the custom maps I made in 1.6 on LAN parties.I made a map where both teams started in pirate ship vehicles and their only weapon was a knife, and they could sail to islands where there was HE grenades. That meant the both pirate ships tried to board each other on the way to the HE grenade, and often someone got stranded on the other ship and had to be rescued by his captain.I also made a SAW (the movie) inspired map with many psychological puzzles that were very entertaining to play at LAN parties.Example: a room has a box that you need to be boosted up to. Up there is a button and a rifle. The button opens the next room, in which there's a dangerous path one player can take to allow all others to pass safely. If no one risks taking that dangerous path then they all need to take a semi-dangerous path.What often ended up happening was that the person who got the gun in the previous room forced one player to go the dangerous path to then pass safely himself. That of course meant people argued a lot about who was most trustworthy to get the gun. That gamemode was really fun. :D","score_com":1,"title":"The CS nostalgia thread","selftext":"Ok so we are slowly finishing off the year. Firstly, happy New Years everyone. This year has really sparked my love for CS back up, ill admit I was a 1.6er that just couldn't adapt to source. This year we have seen lots of decent tournaments and some nice updates from valve. We all know there is plenty more to go but so far, I'm loving go. Thank you valve. So, this got me thinking about the good old times and it brought back some real nostalgic feelings. So to reign in the near, lets remember the good old times. Let everyone remember the good old times of CS old and new. For me:- CS assault. One of the good old maps. Remember entering top vents? BOOM 5 Terrorists spamming you in vents. Remember entering back squeaky doors? BOOM 5 terrorists spamming you again. - the music in CS Italy. - the various noises that gave away your positions on maps - lightening on Bridge on Aztec. Same on steps. - sheep (I think) on cbbl. What about you guys?","score":42},"53":{"subreddit":"52weeksofcooking","id":"15qnr7","comment_body":"Welcome dipthonggirl as mod! Great first intro post :)Happy new year from Australia! 2013 is great, you'll love it. I'm currently on my way to the beach!I've got an idea or two for appetisers, can't wait to jump into another year of cooking. Inspired by music has got me stumped though, glad I still have a couple of weeks to think about it :)","score_com":5,"title":"Week 1 Introduction Thread: Appetizers","selftext":"Welcome to 2013!This week we're doing [Appetizers]( aka Hors d'oeuvres. This is definitely a category with lots of possibilities. Appetizers are meal starters, a first course, or food served during the Cocktail Hour. Sometimes I like to just get a few appetizers at a restaurant and share them rather than get individual entrees. Many of you will probably have some with champagne tonight to ring in the New Year. Will you make some fresh cut [Crudités]( or a delicate Amuse-Bouche? Forks are optional!Here's a [list of recipes]( to get your juices (or drool) flowing.Don't forget to challenge yourself, but above all else, HAVE FUN! HAPPY NEW YEAR!!!!","score":41},"60":{"subreddit":"LiverpoolFC","id":"15qz58","comment_body":"Wow, this is a wonderfully inspiring, and not tremendously inaccurate, portrait of Suarez as a very effective anti-hero. I like it. LFC are lucky to have such a character.","score_com":4,"title":"Strange as it seems, Suarez has become a model, modern hero. The Uruguayan always plays as if the fate of the world depends on his next move","selftext":"","score":29},"62":{"subreddit":"gaybros","id":"15qggz","comment_body":"According to Last.fm, my most played track was [Steep Hills of Vicodin Tears]( I'd say it actually sums up the year quite nicely. Nothing particularly grandiose, but still somewhat uplifting.","score_com":1,"title":"Gaybros, what song describes your 2012?","selftext":"AKA if your year had a theme song, what would it be?Mine would be [*This Year* by The Mountain Goats]( \"I am gonna make it through this year if it kills me.\"","score":27},"66":{"subreddit":"wow","id":"15q3e8","comment_body":"I grew pretty tired of my mistweaver. I think it's the renewing-mist and uplift combo that gets to me.","score_com":1,"title":"So what is the verdict on monks?","selftext":"I am curious to see what every ones verdict on the monk class is thus far. Has anyone committed to making it their main? If so why and in which areas do you excel?The reason I am asking is because I have had some fair enjoyment from playing mine thus far (level 80) I am very interested in knowing how well they do as DPS in PVP. I currently main a mage but am interested in having a melee class and as of now I am leaning towards either a rogue or monk. (rogue simply because they feel like the melee version of a mage)","score":24},"67":{"subreddit":"wow","id":"15q3e8","comment_body":"I'll outline some stuff for mistweavers, as I've been raiding on one since the beginning of MoP. and I see very few people posting that have been doing progression.AoE healing is extremely strong. People do not recognize the usefulness of Thunderfocus tea, which allows us to renew all of our Renewing Mists on players. Uplift is insane if you can get the chi procs from soothing mist or jab. Spinning crane kick is shit now though, and is only useful on burn phases where it's feasable to stack. The mana cost is simply too high, with little return on Chi.Tank healing is decent. Life Cocoon is an amazing CD, but it's hard to figure out when to use it unless your tank is extremely vocal about cooldown rotations. Surging mist is a mana dump, so it needs to be avoid at all costs unless you feel like going for the free surge from spamming tiger palm. (not worth it seriously, the jab cost is insane high). Enveloping Mists is a great heal, but you need to grab the chi for it extremely fast if it's needed. Generally I can get soothing mist to proc enough for it.TLDR; Monks need to keep tanks topped off at all times to be at all viable. Cocoon is the only mana efficient recovery method.Utiity is shit. Revival is a nice cooldown, but it's sudden, and it's used to keep the lowest in health from death. At times, that means overhealing others by 33%. Single target healing is extremely viable. Far better than healing wave, heal, etc. It can't overheal. It's almost impossible.PLaying a monk properly is a huge skill gap. You need to manage a lot of different mechanics, and mana consumption is one of them. If you figure out how to burn chi at the right moments, you'll do great.","score_com":1,"title":"So what is the verdict on monks?","selftext":"I am curious to see what every ones verdict on the monk class is thus far. Has anyone committed to making it their main? If so why and in which areas do you excel?The reason I am asking is because I have had some fair enjoyment from playing mine thus far (level 80) I am very interested in knowing how well they do as DPS in PVP. I currently main a mage but am interested in having a melee class and as of now I am leaning towards either a rogue or monk. (rogue simply because they feel like the melee version of a mage)","score":24},"71":{"subreddit":"BALLET","id":"14kqc5","comment_body":"That may be one of the most amazing things I've ever seen!! Ridiculous!! And beautiful and inspiring! Thanks for the link!","score_com":2,"title":"Great Chinese State Circus- Swan Lake.. I know it's not technically ballet, but.. it's pretty amazing when she's en pointe one 1 LEG in arabesque, on his head AND turns.","selftext":"","score":20},"74":{"subreddit":"crafts","id":"xy5h4","comment_body":"Super impressed! You have inspired me.","score_com":1,"title":"Homemade stuffed animals","selftext":"This is my first post so i hope this works...7 years ago, my wife was pregnant with our first child and i decided that i wanted to make some homemade toys for our yet-to-be born daughter. One of the projects i started was to make stuffed animals. Below are 3 of the first ones i made - these are all hand sewn. I didn't use any templates at all - i just sketched out what i wanted them to look like, cut the fabric, stuffed and sewed. Each one of these took between 10-20 hours. (i know it is painfully slow, but i had never sewn anything before and i was usually watching a baseball game while i was making them) :)Here they are","score":15},"77":{"subreddit":"feedthebeast","id":"15q8o9","comment_body":"While everyone else on my server learned IC2, I was busy learning Mystcraft. I designed our servers teleport room, and will soon make my new base, with design ideas inspired by Doctor Who, and other scifi type things.","score_com":2,"title":"How do you feed *your* beast?","selftext":"With a modpack as robust and diverse as FTB, there are so many directions you can go in, it can sometimes be a bit intimidating to decide what to do first\/next. I figured I would ask the community what they do. Hopefully this thread can inspire a person or two who was getting bored, and thought they were \"done\" with the modpack.Personally, at the moment I have two \"beasts\" I am feeding, the first \"beast\" is figuring out computercraft, and how to control my entire base from one central computer. The second \"beast\" is Thaumcraft 3. Learning it, crafting the golems, manipulating Vis, and getting shocked by wisps, lol. Everything I do in the game is for the benefit of those two \"beasts\", they are my end goal.But that is just me, and this post isn't about me, it's about *you*, so I will restate the question I posed in the title: How do you feed *your* beast?","score":13},"78":{"subreddit":"TheLastAirbender","id":"15qutw","comment_body":"Bending should remain as it is, what would really benefit from a \"maturity boost\" are sword fights. In their current form, sword fights have predictable endings (no one will get touched by the blades) and the sword fighters have ridiculously impractical fighting strategies. Remember that one scene in the finale where Sokka and Toph were stuck between two fire benders standing on metal platforms? Sokka throws his boomerang at the left one, knocking him off the platform to make a badass takedown. For the second one Sokka grabs his sword and throws it at the metal platform under the fire bender. Instead of being awe-inspiring, I couldn't help but laugh a little and ask myself, \"why didn't he just throw it at the guy?\" Another instance of impractical fighting is Sokka (again) on the Day of Black Sun, where he hijacks a rhino-thingy by cutting the rider's spear right through the middle and then knocking him off.","score_com":1,"title":"I think it would be interesting to see a more intense version of A:TLA","selftext":"Think about all of the things benders can do that aren't in the shows.* Water benders can dry a person out.* Air benders can suck the air out of your lungs.* Earth benders can remove minerals from your body (iron).* Fire benders can literally make your blood boil.I know it's a kid's show which limits the amount and type of violence\/warfare they can show, but there are such limitless possibilities as to what benders can actually do! I absolutely love A:TLA, and is probably one of my favorite series ever - it would have been so much more intense if they had some more creative ways to use bending abilities. Anyone else think the same?","score":13},"79":{"subreddit":"MTB","id":"15qz1y","comment_body":"I have a friend who makes some of his own components. My concerns are what material somebody is using. Most stuff coming out of professional bike houses are 7000 series T6 hardened aluminum. That stuff is stiff and durable. 6000 series not so much, and anything else I'd be scared to run on my bike. Cheap garbage metal is not confidence inspiring unless it's a non-essential part. Chainrings, stem, seatpost interfaces, fork crowns...no thanks unless it's the good stuff.","score_com":1,"title":"Anybody custom fabricate their own parts?","selftext":"I am getting bigger into biking (road and mountain) and being a mechanical engineer am always thinking of different designs for parts\/accessories of my own. Built a few items like billet clamps, mounting hardware, chain rings, and bash rings. Anyone here care to post or share their own designs\/custom parts\/solutions they have come up with?","score":12},"80":{"subreddit":"exmormon","id":"15q89j","comment_body":"the other day I was on a rant, annoyed at how the church controls so many of the people in my life, annoyed that my friends would hate me if they knew who I really am, and just pissed off that my family Christmas was a bust. I was laying on the floor ranting about the church and my husband says \"I think you're not just anti-religion, you sound anti-mormon.\" Though that's not how I feel - I don't hate the church because it is the church, but I hate the way it influences my life. So... yes. I've been known to say mean things, though they were inspired by my real pains, and not just an arbitrary hatred of the church.","score_com":2,"title":"Have you ever caught yourself saying legitimately offensive\/hurtful things about Mormons?","selftext":"A few weeks ago I was out at Crown Burger with some friends and me and another male friend began talking about Mormons. I said something along the lines of \"Mormon girls are completely undatable. Once I find out a girl is Mormon, her attractiveness disappears.\" I had recently gone through a sudden breakup where religion was a factor and so I was feeling somewhat bitter in general, especially towards religion and relationships.Anyway, there were two of my LDS (female) friends sitting at the table. After what I said went through my mind again a few hours later, I realized how terrible it sounded. I apologized to them and clarified that I said what I did out of spite, not because it was actually true. TL;DR implied all Mormon girls are ugly, apologized. What shenanigans are y'all up to?","score":12},"81":{"subreddit":"Fantasy_Bookclub","id":"15qwl9","comment_body":"The Magicians by Lev GrossmanI find it is a very polarizing book. It doesnt have conventionally likable characters or an uplifting message, which doesnt set well with some people. Its a great book for discussion. Also, magic boarding school! Always a great concept.","score_com":9,"title":"Vote for January's official book of the month.","selftext":"Nominate a book and give a brief reason why you think it would be a good choice for the book club. The book with the most upvotes will be the official book of the month for us to read and discuss.Voting will end on the 5th.","score":11},"82":{"subreddit":"asktransgender","id":"15pa92","comment_body":"Felt like something was wrong 5 1\/2 y\/o, looked into what an SRS was 10 y\/o (did not understand it), crossdressing wasn't enough &amp; went out as female 16 y\/o (sporadically &amp; did not last out of fear, went into the closet...literally sometimes), but it wasn't until I was around 24 y\/o when I became friends with a few trans girls that I actually considered transitioning. It was when my really good friend was scared &amp; getting her orchi that I kinda broke down, I was proud of her &amp; it was a bit inspiring for me. I dunno if that's too long of an answer but I'm 26 now, so either all my life or 2 years....whatever.","score_com":3,"title":"How long have you guys known youre trans?","selftext":"I know that for me, I never even considered life as a girl to be an actual option until this year. The idea of a sex change seemed extremely far fetched and almost science fictiony. I never used to cry to myself because I was a boy or even question whether or not I was a boy. What about you guys? how long have you known youre trans?","score":11},"84":{"subreddit":"hinduism","id":"15qlol","comment_body":"Oh, and these, because they remind me of some great people and they inspire me.\"One who is not envious but is a kind friend to all living entities, who does not think himself a proprietor and is free from false ego, who is equal in both happiness and distress, who is tolerant, always satisfied, self-controlled, and engaged in devotional service with determination, his mind and intelligence fixed on me - such a devotee of Mine is very dear to me.\" 12.13-14\"He for whom no one is put into difficulty and who is not disturbed by anyone, who is equipoised in happiness and distress, fear and anxiety, is very dear to Me.\" 12.15\"One who is equal to both friends and enemies, who is equipoised in honor and dishonor, heat and cold, happiness and distress, fame and infamy, who is always free from contaminating association, who is always silent and satisfied with anything, who doesn't care for any residence, who is fixed in knowledge and engaged in devotional service - such a person is very dear to Me.\" 12.18-19","score_com":3,"title":"On of my favorite quotes from the gita, what are yours?","selftext":"Thus spoke the Blessed Lord: \"In My opinion, the most perfect in yoga are those who invest their minds in Me and worship Me with supreme faith, being in constant communion with Me.\"","score":10},"87":{"subreddit":"rpg","id":"15pead","comment_body":"[BBC]( has a article about witch hunts in 1640.A person you may want to read up on is [Matthew Hopkins](I have a Dutch Revolt campaign going currently using Renaissance D100. I found a wikipedia article on the [Roermond witch trial]( of 1614 which inspired a adventure for my group.","score_com":2,"title":"Sources for 17th Century Witch Hunter game?","selftext":"Howdy, I'm thinking of running a game using the free Renaissance D100 rules and set in 17th Century Europe. A dark game where the players will be witch hunters working for the Crown (or maybe the Pope?). I want a bit of Solomon Kane feel and am planning on having some Call of Cthulhu stuff in the mix also. Any body got any suggestions for good books or other source materials to give me more of a feel for the era?","score":9},"88":{"subreddit":"tattoos","id":"15qg9s","comment_body":"A shop in my hometown will not do any non-Christian religious pieces, nor any nudity, or demon\/devil type artwork. When I first wanted an ancient Egyptian-inspired piece, the owner told me they would not do \"false gods\", and I was free to take my business elsewhere. [So I did, happily.]( It just struck me as odd since marking your body is generally against most Christian doctrines.Their piercer was badass though. Completely professional, no bullshit straight-talker. If I was still into piercings, he'd be my go-to guy. He even did genital piercings, which again, didn't seem to fit the general preachyness of the shop owners.","score_com":15,"title":"Artists: What won't you do?","selftext":"I thought about this when I was in my small home town. I saw one of the newer tattoo artists, who had just started at the only tattoo parlor in the \"city\". He had a Star of David on his neck. A couple of hours later, happenstance found a guy coming in (I was working at a gas station, so these were two separate customers) with a Southern Brotherhood tattoo (it looked too nice to be your typical prison scratching). I thought \"I wonder what the first artist (assuming he had a fondness\/connection for Jewish history\/culture\/religion\/ethnicity, would say had that second guy come in and asked to get that tattoo? So I'm just curious, artists (and I ask this as an attorney with some morals)... gotta pay the mortgage, but what won't you do?","score":9},"89":{"subreddit":"LifeRPG","id":"13jd1g","comment_body":"I made one on Edexel. I was inspired by my Maths teacher who used it to check our progress in the syllabus.The problem is that I can't be asked to open up edexcel everyday. Perhaps a weekly check would be alright.**My point is it would be cool if there was a smartphone app for that.**","score_com":2,"title":"Is there a way to..?","selftext":"I was wondering if there is a way to have daily projects, small things such as go to college, get there on time, draw something, read something etc. it seems like something really useful, maybe if you had a task like \"go to college\" and then a drop down when you click it with the days of the week with tick boxes, you could also have another collum with a \"x\" out of \"a\" sub tasks complete.or maybe this could just be how sub tasks work :D","score":8},"90":{"subreddit":"Warhammer","id":"15pu6c","comment_body":"You've inspired me. I will paint my army as well.","score_com":1,"title":"Figured out a new year's resolution -- get everything painted.","selftext":"I have SO MUCH of my Deathwing-centric Dark Angels army unpainted or underpainted right now. Plus basically all of my infantry-based Imperial Guard army -- half of that isn't even assembled yet!I think this is the year I'm going to get everything painted. With the new DA codex likely to come out very soon (merciful Emperor of Mankind I hope) I'm actually getting excited about 6th Edition. It might be nice to field an actual fully-painted army for a change! I probably won't field everything at my usual top quality right away -- I'll just get them 'tabletop quality' and work on them individually as I get the urge....now if I only had a clue about what lists I'd like to run. It might be time to start playing some random games to see how they all shake out?","score":8},"91":{"subreddit":"homestuck","id":"15nzz3","comment_body":"I thought for sure someone would have mentioned [Prequel]( by now. I guess it's only tangentially related, but it definitely was inspired by Homestuck (and the forums) and uses a lot of the tropes. If you've played Oblivion or Skyrim, this will definitely be something you want to check out.","score_com":1,"title":"Recommend any Homestuck fan works or adventures?","selftext":"I'm relatively new to the fandom, having started reading homestuck a few weeks ago and already posted some content on this very subreddit. But I'm still kinda new and I'mm not really familiar to many fan works.I'm just wondering if anyone could recommend some really solid fan comics, fanfics, or maybe even a website where I could get a fix.","score":8},"93":{"subreddit":"redditgetsdrawn","id":"15qjxc","comment_body":"Sorry to see that your post got downvoted...I just finished this: I call it Eloquent EyesNot exactly what you requested but this was the photo that inspired me :)","score_com":9,"title":"This is my modeling alter-ego, Talia Knight (A.K.A. Tali).. Anyone care to draw her?","selftext":"Tali has been around for about three years now.. It's hard for her to find work in the rural southern United States, but maybe one day she can make it in a big city. Or maybe not.. I'm sure I'll be happy any way.. And hopefully I'll have a lovely drawing to add to my personal collection.***I'm sorry I don't have a picture for the icon.. Still learning about posting on Reddit (I lurked for months and finally decided to post). Link to Album :","score":4},"94":{"subreddit":"ABraThatFits","id":"15p9fn","comment_body":"I wonder which brands, too... some are quite stretchy in the band while others are not.one thing to remember when looking for extreme push up bras, and something that drove me *bananas* once the classic wonderbra front closure push-up was discontinued and genericizing molded cups took over: when you're looking at \"extreme uplift\" or \"super boost\" or \"vavoom\" or whatever advertising language they're using, the size on the label is the size you will *look* with the bra on, not what size tits will actually fit in the damned thing!so when you're looking at, say VS's Bombshell line, the smallest cup in a 38 band is a C, but it won't fit a woman who actually wears 38C, but a woman who wears 38A. this might work for your friend. I have been frustrated by this so many times that I can't even tell you how glad I am to be able to tell a woman who might be able to make use of it!","score_com":2,"title":"38AA push-up styles?","selftext":"I have a friend who is searching for her first bra that fits (she is currently wearing a bikini top). She measures 36\" underbust, 37\" overbust. We recently tried on some 36As in several different brands, but the band was actually too small on all of them. She'd prefer a push-up style, as she doesn't have much breast tissue and push-ups make it appear as though she has more (she's a transwoman and in the first stages of transitioning, so she may have more breast tissue in the future. Its hard to say at this point, as she just started HRT). Is there anywhere we could find decent padded bras in a 38AA to order and try? 36\" bands just are not working, she could not even make the ends meet, despite her underbust measurement. Thanks for any advice anyone has!","score":4},"97":{"subreddit":"Hardcore","id":"15q775","comment_body":"Atlanta is doing cool things right now. Especially if you want jams inspired by 90s hardcore. Foundation is rad and deathbed has an awesome 90s sound.","score_com":2,"title":"Recommendations for an old mosher","selftext":"Hello all, 30 something old mosher here who hasn't been to a show in forever. I'm looking for some recommendations, any new bands that would be worth listening to that may have come out in the last 5 years are so that I may have missed.Recently dug out my old vinyl collection and started reminiscing so thought I'd see what I've missed over the years.Back in the day I was a big fan of bands such as...* Champion* Blue Monday* Vision Of Disorder* Madball* Terror* The Promise* Throwdown (anything pre-Haymaker)* Indecision* Shockwave* Broken Oath* One King Down* Verse* Knuckledust* Ninebar* Most Precious BloodThings of that ilk really.Any suggestions would be appreciated!","score":4},"100":{"subreddit":"nuzlocke","id":"15p4k2","comment_body":"Trying my first ever run, and I do quite agree that it makes you value your pokemon a lot more. IT also is oddly creative as well, which inspired me to make a story as well about my character's journeys. I'm hoping to make my first post about it here in the next few days.","score_com":1,"title":"Why do you nuzlocke?","selftext":"Backstory: I just started my own nuzlocke (red classic rolling with felix the charmander) and lost already a few friends. The road is long and hard, and it's just a game. Even if I DO WIN, make it to the hall of champs, what have I sacrificed in real life. The harsh mistress I return to after a save.How long did you guys\/gals take to complete it, and why? Was it worth it?","score":3},"102":{"subreddit":"askphilosophy","id":"15qfb4","comment_body":"I first understood the point of philosophy after I read Meditations on First Philosophy by Descartes. It inspired me to question things and start coming to my own conclusions about the world. Its a relatively short and easy read.","score_com":1,"title":"New to philosophy: where do I start?","selftext":"I am a person who has been interested in studying some sort of philosophy for a while now, but have never had the time to delve into such things in any depth or at all, really. I'm wondering what sort of books or internet stuff I should read as a sort of introduction regarding the discipline, or just something to start with that wouldn't be overly complex or convoluted.","score":1}}
